module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :アビオルグ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/34/FrontierGen-Abiorugu_Render_001.png/revision/latest/scale-to-width-down/350?cb=20140831155147"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/903891300720472114/abiorugu.png"
        msg.respond "***切削ダメージに基づく***
    **名前:** アビオルグ
    **タイトル:** 獰竜
    **ランク:** HR1-4
    **弱い:**  氷 <:zice:883119912283938816>,   水 <:zwater:883120128017965066> と   雷 <:zthunder:883120020312440852>
    **病気:** 気絶 <:stun:883125464397398106> と 防御力低下 <:defdown:883125247551893514> 
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35      0      10    10     0    20   100
    \n   右脚          40    35     30      0      10    10     0    20     0
    \n   左脚          25    25     20      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          40    45     30      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り1)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35      0      10    10     0    20   100
    \n   右脚          45    40     35      0      10    10     0    20     0
    \n   左脚          25    25     20      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          45    50     35      0       5     5     0     5     0
    ```"
    msg.respond "```
    \n                                 肉質(怒り2)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     35      0      10    10     0    20   100
    \n   右脚          50    45     40      0      10    10     0    20     0
    \n   左脚          25    25     25      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          50    55     40      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                 肉質(怒り3)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     40      0      10    10     0    20   100
    \n   右脚          55    50     45      0      10    10     0    20     0
    \n   左脚          25    30     25      0       5     5     0    10     0
    \n   手            35    35     25      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          35    30     30      0       5     5     0     5     0
    \n   背棘          55    60     45      0       5     5     0     5     0
    ```"

      end
      command :アビオルグ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/4/40/FrontierGen-HC_Abiorugu_Render_001.png/revision/latest?cb=20150722094608"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/903891300720472114/abiorugu.png"
        msg.respond "***切削ダメージに基づく***
    **名前:** アビオルグ
    **タイトル:** 獰竜
    **ランク:** HR5-剛種
    **弱い:**  氷 <:zice:883119912283938816>,   水 <:zwater:883120128017965066> と   雷 <:zthunder:883120020312440852>
    **病気:** 気絶 <:stun:883125464397398106> と 防御力低下 <:defdown:883125247551893514> 
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35      0      10    10     0    20   100
    \n   右脚          40    35     30      0      10    10     0    20     0
    \n   左脚          25    25     20      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          40    45     30      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り1)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35      0      10    10     0    20   100
    \n   右脚          45    40     35      0      10    10     0    20     0
    \n   左脚          25    25     20      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          45    50     35      0       5     5     0     5     0
    ```"
    msg.respond "```
    \n                                 肉質(怒り2)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     35      0      10    10     0    20   100
    \n   右脚          50    45     40      0      10    10     0    20     0
    \n   左脚          25    25     25      0       5     5     0    10     0
    \n   手            30    30     20      0       5     5	    0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          50    55     40      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                 肉質(怒り3)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     40      0      10    10     0    20   100
    \n   右脚          55    50     45      0      10    10     0    20     0
    \n   左脚          25    30     25      0       5     5     0    10     0
    \n   手            35    35     25      0       5     5     0    10     0
    \n   胴体          30    25     20      0       5     5     0     5     0
    \n   尻尾          35    30     30      0       5     5     0     5     0
    \n   背棘          55    60     45      0       5     5     0     5     0
    ```"

      end
      command :アビオルグ_G do |msg|
      # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/8/8b/FrontierGen-Abiorugu_Render_004.png/revision/latest/scale-to-width-down/185?cb=20140121152414"
      msg.respond "https://cdn.discordapp.com/attachments/902336832069595197/903891300720472114/abiorugu.png"
      msg.respond "***切削ダメージに基づく***
    **名前:** アビオルグ
    **タイトル:** 獰竜
    **ランク:** Ｇ級
    **弱い:**  氷 <:zice:883119912283938816>,   水 <:zwater:883120128017965066> と   雷 <:zthunder:883120020312440852>
    **病気:** 気絶 <:stun:883125464397398106> と 防御力低下 <:defdown:883125247551893514> 
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     30      0      10    10     0    20   100
    \n   右脚          35    30     25      0      10    10     0    20     0
    \n   左脚          20    20     15      0       5     5     0    10     0
    \n   手            25    25     15      0       5     5     0    10     0
    \n   Torso         25    20     15      0       5     5     0     5     0
    \n   尻尾          25    20     20      0       5     5     0     5     0
    \n   背棘          35    40     25      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り1)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0      15    15     0    30   100
    \n   右脚          40    35     30      0      15    15     0    30     0
    \n   左脚          20    20     20      0       5     5     0    20     0
    \n   手            25    25     15      0       5     5     0    20     0
    \n   胴体          25    20     15      0       5     5     0     5     0
    \n   尻尾          25    20     20      0       5     5     0     5     0
    \n   背棘          40    45     30      0       5     5     0     5     0
    ```"
    msg.respond "```
    \n                                 肉質(怒り2)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     30      0      20    20     0    40   100
    \n   右脚          45    40     35      0      20    20     0    40     0
    \n   左脚          20    20     25      0       5     5     0    30     0
    \n   手            25    25     15      0       5     5     0    30     0
    \n   胴体          25    20     15      0       5     5     0     5     0
    \n   尻尾          25    20     20      0       5     5     0     5     0
    \n   背棘          45    50     35      0       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                 肉質(怒り3)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     35      0      25    25     0    50   100
    \n   右脚          50    45     40      0      25    25     0    50     0
    \n   左脚          20    25     25      0       5     5     0    40     0
    \n   手            30    30     20      0       5     5     0    40     0
    \n   胴体          25    20     15      0       5     5     0     5     0
    \n   尻尾          30    25     25      0       5     5     0     5     0
    \n   背棘          50    55     40      0       5     5     0     5     0
    ```"

    end
    end
end