module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :アカムトルム do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/18/2ndGen-Akantor_Render_001.png/revision/latest?cb=20150304010024"
        msg.respond "https://cdn.discordapp.com/attachments/902336832069595197/904521532687151125/akantor.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アカムトルム
    **別名:** 覇竜
    **ランク:** HR1-4
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   雷 <:zthunder:883120020312440852>
    **状態異常:** 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    55     40      0       5    20    35     0   100
    \n   首            35    45     25      0       5    15    20     0     0
    \n   腹            35    50     25      0       5    15    20     0     0
    \n   背中          20    25     30     10       5    15    20     0     0
    \n   尻尾          30    35     40      0       5    30    40     0    10
    \n   前脚          30    35     20      0       5    10    15     0     0
    \n   後脚          30    30     25      0       5    15    30     0     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(腹蓄積時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     30      0      20    20    20     0   150
    \n   首            35    50     25      0      15    15    10     0     0
    \n   腹            50    60     25     15      25    40    10     0     0
    \n   背中          60    30     40      0      15    15    10     0     0
    \n   尻尾          30    30     20      0      10    30    10     0     0
    \n   前脚          30    35     25      0      10    15    15     0     0
    \n   後脚          20    15     20      0      10    15    10     0     0
    ```"

      end
      command :アカムトルム_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e9/FrontierGen-HC_Akantor_Render_001_%28Edited%29.png/revision/latest?cb=20140119095939"
        msg.respond "https://cdn.discordapp.com/attachments/902336832069595197/904522911606526062/akantorhr5.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アカムトルム
    **別名:** 覇竜
    **ランク:** HR5
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   雷 <:zthunder:883120020312440852>
    **状態異常:** 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     20      5       0     0    -5    -5   100
    \n   首            15    30     30      0      -5     5   -10    -5     0
    \n   腹            30    40     15      0       5     5     0     0     0
    \n   背中          30    25     20      0       5     5    -5     0     0
    \n   尻尾          25    35     20      0       0     0   -10     0    10
    \n   前脚          20    10     10     -5       0    -5   -10    -5     0
    \n   後脚          20    10     15      0      -5    -5   -10    -5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(腹蓄積時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     15      0       0     5    -5     0   150
    \n   首            30    30     40      0       5     0     0    -5     0
    \n   腹            50    50     15     10      10     0    30    20     0
    \n   背中          40    30     20      0       5     0     0     0     0
    \n   尻尾          30    50     20      0       0     5    -5     0     0
    \n   前脚          10    15     10      0      -5     5     0    -5     0
    \n   後脚          10    15     10     -5       0     5     0     0     0
    ```"

      end  
      command :アカムトルム_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/22/Akantor.png/revision/latest?cb=20130611071547"
        msg.respond "https://cdn.discordapp.com/attachments/902336832069595197/904521532687151125/akantor.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アカムトルム
    **別名:** 覇竜
    **ランク:** Ｇ級
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   雷 <:zthunder:883120020312440852>
    **状態異常:** 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     30      0       5    20    30     0   100
    \n   首            25    35     15      0       5    15    15     0     0
    \n   腹            25    40     15      0       5    15    15     0     0
    \n   背中          10    15     20     10       5    15    15     0     0
    \n   尻尾          20    25     30      0       5    30    35     0    10
    \n   前脚          20    25     10      0       5    10    10     0     0
    \n   後脚          20    20     15      0       5    15    20     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(腹蓄積時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    50     20      0      25    20    35     0   150
    \n   首            25    40     15      0      20    15    20     0     0
    \n   腹            35    50     15     15      30    40    20     0     0
    \n   背中          30    20     30      0      20    15    20     0     0
    \n   尻尾          20    20     15      0      15    30    40     0     0
    \n   前脚          20    25     10      0      15    15    15     0     0
    \n   後脚          10    10     10      0      15    15    25     0     0
    ```"

      end
    end
end