module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :アマツマガツチ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3e/MHP3-Amatsu_Render_001.png/revision/latest?cb=20140513014804"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904524368573517864/amatsu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アマツマガツチ
    **別名:** 嵐龍
    **ランク:** HR5-遷悠
    **弱点属性:**    龍<:zdragon:883119756528476161> と   火<:zfire:883120156916744312>
    **状態異常:**   水属性やられ小<:zwater:883120128017965066> と    龍属性やられ小<:zdragon:883119756528476161>
    **属性:**   水<:zwater:883120128017965066> と    龍<:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    45     38     25       0    15    35    10   100
    \n   首            28    24     12     15       0     0     5     5     0
    \n   背中          24    20     12     15       0     0    10     5     0
    \n   腹            34    35     24     20       0    10    20     5     0
    \n   前脚          27    30     27     20       0    10    20     5     0
    \n   後脚          20    26     10     15       0     0    20     5     0
    \n   尻尾          37    24     12     20       0     0    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    50     43     25       0    15    35    10   100
    \n   首            28    24     12     15       0     0     5     5     0
    \n   背中          24    20     12     15       0     0    10     5     0
    \n   腹            34    35     24     20       0    10    20     5     0
    \n   前脚          27    30     27     20       0    10    20     5     0
    \n   後脚          20    26     10     15       0     0    20     5     0
    \n   尻尾          37    24     12     20       0     0    10     5     0
    ```"

      end
      command :アマツマガツチ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/35/FrontierGen-Amatsu_Render_001.png/revision/latest?cb=20171013102238"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904524938369728555/amatsug.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アマツマガツチ
    **別名:** 嵐龍
    **ランク:** Ｇ級-遷悠
    **弱点属性:**    龍<:zdragon:883119756528476161> と   火<:zfire:883120156916744312>
    **状態異常:**   水属性やられ小<:zwater:883120128017965066> と    龍属性やられ小<:zdragon:883119756528476161>
    **属性:**   水<:zwater:883120128017965066> と    龍<:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            31    35     25     20       0    10    25    10   100
    \n   首            22    18     15     15       0     0     5     5     0
    \n   背中          18    15     15     15       0     0    10     5     0
    \n   腹            27    28     20     20       0    10    15     5     0
    \n   前脚          24    24     20     15       0    10    15     5     0
    \n   後脚          15    18     35     10       0     0    10     5     0
    \n   尻尾          21    18     20     15       0     0    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            36    40     25     20       0    10    25    10   100
    \n   首            22    18     15     15       0     0     5     5     0
    \n   背中          18    15     15     15       0     0    10     5     0
    \n   腹            27    28     20     20       0    10    15     5     0
    \n   前脚          24    24     20     15       0    10    15     5     0
    \n   後脚          15    18     35     10       0     0    10     5     0
    \n   尻尾          21    18     20     15       0     0    10     5     0
    ```"


  
      end
    end
end