module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ベルキュロス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/a/a1/FrontierGen-Berukyurosu_Render_001.png/revision/latest?cb=20140906080828"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904786476057894982/berukyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ベルキュロス
    **別名:** 舞雷竜
    **ランク:** HR1-4
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   雷 <:zthunder:883120020312440852>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     15      5       5     0     5    20   150
    \n   胴体          30    30     10      5      10     0     5    25     0
    \n   翼            30    15     30      5      10     0     5    25     0
    \n   鉤爪          15    30     60      5      15     0     5    35     0
    \n   脚            20    20     15      5       5     0     5    15     0
    \n   副尾          35    15     50      5      10     0     5    25     0
    \n   尻尾          35    15     40      5      10     0     5    25     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                    肉質(破壊した部位単位で変化[右記参照])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    45     25      5       5     0     5    20   150
    \n   胴体          40    40     20      5      10     0     5    25     0
    \n   翼            40    25     40      5      10     0     5    25     0
    \n   鉤爪          25    40     70      5      15     0     5    35     0
    \n   脚            20    20     15      5       5     0     5    15     0
    \n   副尾          45    25     60      5      10     0     5    25     0
    \n   尻尾          45    25     50      5      10     0     5    25     0
    ```"

end
      command :ベルキュロス_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/5/50/FrontierGen-HC_Berukyurosu_Render_001.png/revision/latest?cb=20140821065353"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904786476057894982/berukyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ベルキュロス
    **別名:** 舞雷竜
    **ランク:** HR5-剛種
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   雷 <:zthunder:883120020312440852>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     15      5       5     0     5    20   150
    \n   胴体          30    30     10      5      10     0     5    25     0
    \n   翼            30    15     30      5      10     0     5    25     0
    \n   鉤爪          15    30     60      5      15     0     5    35     0
    \n   脚            20    20     15      5       5     0     5    15     0
    \n   副尾          35    15     50      5      10     0     5    25     0
    \n   尻尾          35    15     40      5      10     0     5    25     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                     肉質(破壊した部位単位で変化[右記参照])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    45     25      5       5     0     5    20   150
    \n   胴体          40    40     20      5      10     0     5    25     0
    \n   翼            40    25     40      5      10     0     5    25     0
    \n   鉤爪          25    40     70      5      15     0     5    35     0
    \n   脚            20    20     15      5       5     0     5    15     0
    \n   副尾          45    25     60      5      10     0     5    25     0
    \n   尻尾          45    25     50      5      10     0     5    25     0
    ```"

end
      command :ベルキュロス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/08/FrontierGen-Berukyurosu_Render_002.png/revision/latest?cb=20140118122811"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904786476057894982/berukyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ベルキュロス
    **別名:** 舞雷竜
    **ランク:** Ｇ級
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   雷 <:zthunder:883120020312440852>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    40     15      5       5     0     5    20   150
    \n   胴体          25    30     10      5      10     0     5    25     0
    \n   翼            25    15     25      5      10     0     5    25     0
    \n   鉤爪          20    35     50      5      15     0     5    35     0
    \n   脚            20    30     15      5       5     0     5    15     0
    \n   副尾          40    15     40      5      10     0     5    25     0
    \n   尻尾          45    15     35      5      10     0     5    25     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                     肉質(破壊した部位単位で変化[右記参照])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      5       5     0     5    20   150
    \n   胴体          35    40     20      5      10     0     5    25     0
    \n   翼            35    25     35      5      10     0     5    25     0
    \n   鉤爪          30    45     60      5      15     0     5    35     0
    \n   脚            20    30     15      5       5     0     5    15     0
    \n   副尾          45    25     50      5      10     0     5    25     0
    \n   尻尾          55    25     50      5      10     0     5    25     0
    ```"

end
    end
end