module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :グラビモス亜種 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/d/df/MHF1-Black_Gravios_Render_001.png/revision/latest?cb=20140112101418"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904788852672192622/blackgravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス亜種
    **タイトル:** 黒鎧竜
    **ランク:** HR1-4
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5     0     0   100
    \n   首            30    30     20      0      30     5     0     0     0
    \n   背中          20    30     20      0      25     5     0     0     0
    \n   腹            15    25     20      0      35     5     0     0     0
    \n   尻尾          25    30     20      0      30     5     0     0     0
    \n   翼            20    20     20      0      20     5     0     0     0
    \n   脚            15    25     20      0      30     5     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5     0     0   200
    \n   首            30    30     20      0      30     5     0     0     0
    \n   背中          20    30     20      0      25     5     0     0     0
    \n   腹            80    80     75     10      50     5    30     0     0
    \n   尻尾          25    30     20      0      30     5     0     0     0
    \n   翼            20    20     20      0      20     5     0     0     0
    \n   脚            15    25     20      0      30     5     0     0     0
    ```"

end
      command :グラビモス亜種_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/d/d5/FrontierGen-HC_Black_Gravios_Render_001.png/revision/latest?cb=20140817142650"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904788852672192622/blackgravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス亜種
    **タイトル:** 黒鎧竜
    **ランク:** HR5
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     30      0      10     5     0     0   100
    \n   首            40    40     30      0      30     5     0     0     0
    \n   背中          30    40     35      0      20     5     0     0     0
    \n   腹            30    40     25      0      30     5     0     0     0
    \n   尻尾          35    40     30      0      30     5     0     0     0
    \n   翼            30    30     30      0      20     5     0     0     0
    \n   脚            25    35     30      0      30     5     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     30      0      10     5     0     0   200
    \n   首            40    40     30      0      30     5     0     0     0
    \n   背中          30    40     35      0      20     5     0     0     0
    \n   腹            70    70     70      0      50     5    40     0     0
    \n   尻尾          35    40     30      0      30     5     0     0     0
    \n   翼            30    30     30      0      20     5     0     0     0
    \n   脚            25    35     30      0      30     5     0     0     0
    ```"

end
      command :グラビモス亜種_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/4/44/MH4-Black_Gravios_Render_001.png/revision/latest?cb=20140105235345"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904788852672192622/blackgravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス亜種
    **タイトル:** 黒鎧竜
    **ランク:** Ｇ級
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5     0     0   100
    \n   首            30    30     20      0      30     5     0     0     0
    \n   背中          20    30     20      0      25     5     0     0     0
    \n   腹            20    25     20      0      45     5     0     0     0
    \n   尻尾          25    30     20      0      30     5     0     0     0
    \n   翼            20    20     20      0      20     5     0     0     0
    \n   脚            15    25     20      0      30     5     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5     0     0   200
    \n   首            30    30     20      0      30     5     0     0     0
    \n   背中          20    30     20      0      25     5     0     0     0
    \n   腹            80    80     70     10      60     5    30     0     0
    \n   尻尾          25    30     20      0      30     5     0     0     0
    \n   翼            20    20     20      0      20     5     0     0     0
    \n   脚            15    25     20      0      30     5     0     0     0
    ```"

end
    end
end