module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer
      
      command :オオナズチ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/d/dd/2ndGen-Chameleos_Render_001.png/revision/latest?cb=20150303014403"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905171486145413170/chameleos.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** オオナズチ
    **タイトル:** 霞龍
    **ランク:** HR1-4
    **弱い:**    龍 <:zdragon:883119756528476161>
    **病気:** 毒 <:zpoison:883122917976719451>, Fatigue, 防御力低下 <:defdown:883125247551893514>  と 声帯麻痺 <:vocal:883123479459815445>
    **要素:**    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    40     40      0       0    20    25    35   100
    \n   胸            35    20     15      5       0    15    20    35     0
    \n   背中          25    15     15      0       0    15    20    25     0
    \n   右脚          20    15     15      0       0    20    10    20     0
    \n  左脚 /腹       25    20     30      0       0    10    20    20     0
    \n   翼            20    10     15      0       0    15    20    10     0
    \n   尻尾          20    15     15      0       0    10     5    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質(ステルス)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    50     50      0       0    20    25    35   100
    \n   胸            30    25     15      5       0    15    20    25     0
    \n   背中          20    15     10      0       0    15    20    20     0
    \n   右脚          10    10     15      0       0    10    10    15     0
    \n  左脚 /腹       20    15     15      0       0    15    20    20     0
    \n   翼            10    10     15      0       0     5    20    10     0
    \n   尻尾          15    15     15      0       0    10     5    10     0
    ```"

end
      command :オオナズチ_HR5 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e3/FrontierGen-HC_Chameleos_Render_001.png/revision/latest?cb=20140902033731"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905171486145413170/chameleos.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** オオナズチ
    **タイトル:** 霞龍
    **ランク:** HR5-剛種
    **弱い:**    龍 <:zdragon:883119756528476161>
    **病気:** 毒 <:zpoison:883122917976719451>, Fatigue, 防御力低下 <:defdown:883125247551893514>  と 声帯麻痺 <:vocal:883123479459815445>
    **要素:**    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     40      5       0     5    30    40   100
    \n   胸            35    20     15      5       0    -5    -5    -5     0
    \n   背中          25    15     15      5       0    -5    -5    -5     0
    \n   右脚          20    15     15      5       0     5    10    25     0
    \n  左脚 /腹       20    35     30      5       0    30    -5    -5     0
    \n   翼            20    35     15      5       0    30     0    -5     0
    \n   尻尾          20    15     15      5       0     5     5    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質(ステルス)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     55      5       0     5    25    40   100
    \n   胸            30    25     15      5       0   -10   -10   -15     0
    \n   背中          20    15     10      5       0   -10   -10   -15     0
    \n   右脚          15    10     15      5       0     5    10    25     0
    \n  左脚 /腹       15    30     15      5       0    25    -5   -15     0
    \n   翼            15    30     15      5       0    25     0   -15     0
    \n   尻尾          15    15     15      5       0     5    -5    15     0
    ```"

end
      command :オオナズチ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/31/MHO-Chameleos_Render_001.png/revision/latest?cb=20160609142207"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905171486145413170/chameleos.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** オオナズチ
    **タイトル:** 霞龍
    **ランク:** Ｇ級
    **弱い:**    龍 <:zdragon:883119756528476161>
    **病気:** 毒 <:zpoison:883122917976719451>, Fatigue, 防御力低下 <:defdown:883125247551893514> と 声帯麻痺 <:vocal:883123479459815445>
    **要素:**    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            38    36     36      5       0     5    30    35   100
    \n   胸            25    10     15      5       0     5    15    35     0
    \n   背中          22    16     15      5       0     5    15    25     0
    \n   右脚          18    16     15      5       0     0    10    20     0
    \n  左脚 /腹       22    20     25      5       0    20    15    20     0
    \n   翼            18    25     15      5       0    20    15    10     0
    \n   尻尾          18    18     15      5       0    25     5    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質(ステルス)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    38     42      5       0    10    30    35   100
    \n   胸            22    15     15      5       0     5    15    25     0
    \n   背中          20    20     10      5       0     5    15    20     0
    \n   右脚          15    20     15      5       0     0    10    15     0
    \n  左脚 /腹       18    24     15      5       0    20    15    20     0
    \n   翼            15    25     15      5       0    20    15    10     0
    \n   尻尾          15    22     15      5       0    25     5    10     0
    ```"

end
    end
end