module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ババコンガ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/7c/2ndGen-Congalala_Render_001.png/revision/latest?cb=20150303041629"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905172255997300746/congalala.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ババコンガ
    **タイトル:** 桃毛獣
    **ランク:** HR1-4
    **弱い:**   火 <:zfire:883120156916744312>
    **病気:** 一部アイテム使用不可 <:fart:883125077481246791>, 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312> (Specific Food Eaten)
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            65    75     60     30      10    10     0    15    50
    \n   前脚          45    40     35     15      10    10     0    15     0
    \n   後脚          45    40     35     15      10    10     0    15     0
    \n   胴体          40    40     40     18      10    10     0    15     0
    \n   尻尾          40    30     25     15      10    10     0    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(腹膨張時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            65    75     60     30      10    10     0     5    50
    \n   前脚          65    15     15     15      10    10     0     5     0
    \n   後脚          65    15     15     15      10    10     0     5     0
    \n   胴体           5     5      5     18       0     0     0     0     0
    \n   尻尾          35    30     15     15      10    10     0     5     0
    ```"

end
      command :ババコンガ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/9/9b/FrontierGen-HC_Congalala_Render_001.png/revision/latest?cb=20140114145541"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905172583538884659/congalalahr5.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ババコンガ
    **タイトル:** 桃毛獣
    **ランク:** HR5
    **弱い:**   火 <:zfire:883120156916744312>
    **病気:** 一部アイテム使用不可 <:fart:883125077481246791>, 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312> (Specific Food Eaten)
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    50     50     10       0     0    10    20    50
    \n   前脚          35    55     40      5      15     0    10     0     0
    \n   後脚          40    35     30      0       0     0     5     0     0
    \n   胴体          35    35     35      5       0     0    15     5     0
    \n   尻尾          50    35     30     15       0     5     5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(腹膨張時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            85    85     80     10       0     0    10    20    50
    \n   前脚          85    20     35      5      15     0    10     0     0
    \n   後脚          85    20     20      0       0     0     5     0     0
    \n   胴体           5     5      5      0       0     0    15     0     0
    \n   尻尾          50    35     20     15       0     5     5     0     0
    ```"

end
      command :ババコンガ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/7c/2ndGen-Congalala_Render_001.png/revision/latest?cb=20150303041629"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/905172255997300746/congalala.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ババコンガ
    **タイトル:** 桃毛獣
    **ランク:** Ｇ級
    **弱い:**   火 <:zfire:883120156916744312>
    **病気:** 一部アイテム使用不可 <:fart:883125077481246791>, 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545> と 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312> (Specific Food Eaten)
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     40     30      10    10     0    15    50
    \n   前脚          30    25     25     15      10    10     0    20     0
    \n   後脚          30    25     25     15      10    10     0    20     0
    \n   胴体          25    25     15     50      10    10     0    15     0
    \n   尻尾          25    20     30     15      10    10     0    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(腹膨張時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     40     30      10    10     0     5    50
    \n   前脚          45    15     15     15      10    10     0     5     0
    \n   後脚          45    15     15     15      10    10     0     5     0
    \n   胴体           5     5      5     50       0     0     0     0     0
    \n   尻尾          20    20     20     15      10    10     0     5     0
    ```"

end
    end
end