module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ディオレックス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/00/FrontierGen-Diorekkusu_Render_001.png/revision/latest?cb=20140423203343"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906200206415134801/diorex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ディオレックス
    **タイトル:**   雷轟竜
    **ランク:** HR5-剛種
    **弱い:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **病気:** なし 
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    25     20    -20     -10   -20    30     0   100
    \n   首            15    15     10    -20     -10   -20    20     0    10
    \n   腹            20    20     15    -20     -10   -20    20     0     0
    \n   背中          20    20     15    -20     -10   -20    20     0     0
    \n   尻尾          15    15     15    -20     -10   -20    20     0     0
    \n   前脚          15    15     15    -20     -10   -20    20     0     0
    \n   後脚          25    15     25    -20     -10   -20    30     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(外殻破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     25      0       0     0     0     0   100
    \n   首            15    15     10      0       0     0     0     0    10
    \n   腹            30    30     20      0       0     0     0     0     0
    \n   背中          30    30     20      0       0     0     0     0     0
    \n   尻尾          30    30     20      0       0     0     0     0     0
    \n   前脚          30    30     20      0       0     0     0     0     0
    \n   後脚          35    30     30      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                          肉質(部位破壊後)																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    55     35      0       0     0    20    10   100  
    \n   首            15    15     10      0       0     0    10     0    10  
    \n   腹            40    45     25      0       0     0    10    10     0  
    \n   背中          40    45     25      0       0     0    10    10     0  
    \n   尻尾          45    40     30      0       0     0    10    10     0  
    \n   前脚          45    40     30      0       0     0    10    10     0  
    \n   後脚          55    50     35      0       0     0    20    10     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(攻撃準備中)																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    60     40      0       0     0    20    10   100  
    \n   首            15    15     10      0       0     0    10     0    10  
    \n   腹            45    50     30      0       0     0    10    10     0  
    \n   背中          45    50     30      0       0     0    10    10     0  
    \n   尻尾          50    45     35      0       0     0    10    10     0  
    \n   前脚          50    45     35      0       0     0    10    10     0  
    \n   後脚          60    55     40      0       0     0    20    10     0  
    ```"

end
      command :ディオレックス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/9/9b/FrontierGen-Diorekkusu_Render_002.png/revision/latest?cb=20140423203802"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906200206415134801/diorex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ディオレックス
    **タイトル:**   雷轟竜
    **ランク:** Ｇ級
    **弱い:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **病気:** なし 
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    15     15    -20     -10   -20    30     0   100
    \n   首            15    15     10    -20     -10   -20    20     0    10
    \n   腹            10    10     10    -20     -10   -20    20     0     0
    \n   背中          10    10     10    -20     -10   -20    20     0     0
    \n   尻尾          10    10     10    -20     -10   -20    20     0     0
    \n   前脚          10    10     10    -20     -10   -20    20     0     0
    \n   後脚          15    10     15    -20     -10   -20    30     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(外殻破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     25      0       0     0     0     0   100
    \n   首            15    15     10      0       0     0     0     0    10
    \n   腹            30    30     20      0       0     0     0     0     0
    \n   背中          30    30     20      0       0     0     0     0     0
    \n   尻尾          30    30     20      0       0     0     0     0     0
    \n   前脚          30    30     20      0       0     0     0     0     0
    \n   後脚          35    30     30      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                          肉質(部位破壊後)																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    55     35      0       0     0    20    10   100  
    \n   首            15    15     10      0       0     0    10     0    10  
    \n   腹            40    45     25      0       0     0    10    10     0  
    \n   背中          40    45     25      0       0     0    10    10     0  
    \n   尻尾          45    40     30      0       0     0    10    10     0  
    \n   前脚          45    40     30      0       0     0    10    10     0  
    \n   後脚          55    50     35      0       0     0    20    10     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                          肉質(攻撃準備中)																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    60     40      0       0     0    20    10   100  
    \n   首            15    15     10      0       0     0    10     0    10  
    \n   腹            45    50     30      0       0     0    10    10     0  
    \n   背中          45    50     30      0       0     0    10    10     0  
    \n   尻尾          50    45     35      0       0     0    10    10     0  
    \n   前脚          50    45     35      0       0     0    10    10     0  
    \n   後脚          60    55     40      0       0     0    20    10     0  
    ```"

end
    end
end