module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ドラギュロス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/07/FrontierGen-Doragyurosu_Render_001.png/revision/latest?cb=20140903210832"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906201564379754556/doragyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドラギュロス
    **別名:** 冥雷竜
    **ランク:** HR1-4
    **弱点属性:**   火 <:zfire:883120156916744312> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     30     10       5     0     0     0   100
    \n   胴体          25    40     10     15       5     0     0     0     0
    \n   翼            45    15     20     10       5     0     0     0     0
    \n   鉤爪          30    40     50     10       5     0     0     0     0
    \n   脚            20    20     15     20       5     0     0     0     0
    \n   副尾          45    25     45     15       5     0     0     0     0
    \n   尻尾          50    30     30     15       5     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    55     35     10       5     0     0     0   100
    \n   胴体          35    45     20     15       5     0     0     0     0
    \n   翼            50    20     30     10       5     0     0     0     0
    \n   鉤爪          35    45     55     10       5     0     0     0     0
    \n   脚            20    20     15     20       5     0     0     0     0
    \n   副尾          50    30     50     15       5     0     0     0     0
    \n   尻尾          55    35     40     15       5     0     0     0     0
    ```"

end
      command :ドラギュロス_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/05/FrontierGen-覇種_Doragyurosu_Render_001.png/revision/latest?cb=20140821081442"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906201564379754556/doragyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドラギュロス
    **別名:** 冥雷竜
    **ランク:** HR5-覇種
    **弱点属性:**   火 <:zfire:883120156916744312> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    45     25      5       5     0     0     0   100
    \n   胴体          20    35     10     10       5     0     0     0     0
    \n   翼            40    10     15      5       5     0     0     0     0
    \n   鉤爪          25    35     40      5       5     0     0     0     0
    \n   脚            15    15     10     15       5     0     0     0     0
    \n   副尾          40    20     35     10       5     0     0     0     0
    \n   尻尾          45    25     25     10       5     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    50     30      5       5     0     0     0   100
    \n   胴体          30    40     15     10       5     0     0     0     0
    \n   翼            45    15     20      5       5     0     0     0     0
    \n   鉤爪          30    40     45      5       5     0     0     0     0
    \n   脚            15    15     10     15       5     0     0     0     0
    \n   副尾          45    25     40     10       5     0     0     0     0
    \n   尻尾          50    30     30     10       5     0     0     0     0
    ```"
    msg.respond "```
    \n                            肉質(復活後(覇種))
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            30    50     20     10       5     0     0     0   100  
    \n   胴体          25    40     10     15       5     0     0     0     0  
    \n   翼            45    15     20     10       5     0     0     0     0  
    \n   鉤爪          30    40     40     10       5     0     0     0     0  
    \n   脚            20    20     15     20       5     0     0     0     0  
    \n   副尾          45    25     25     15       5     0     0     0     0  
    \n   尻尾          50    30     20     15       5     0     0     0     0     
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(復活後怒(覇種))
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    55     25     10       5     0     0     0   100  
    \n   胴体          35    45     10     15       5     0     0     0     0  
    \n   翼            50    20     20     10       5     0     0     0     0  
    \n   鉤爪          35    45     45     10       5     0     0     0     0  
    \n   脚            20    20     15     20       5     0     0     0     0  
    \n   副尾          50    30     30     15       5     0     0     0     0  
    \n   尻尾          55    35     20     15       5     0     0     0     0   
    ```"

end
      command :ドラギュロス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/f0/FrontierGen-HC_Doragyurosu_Render_001.png/revision/latest?cb=20140831213142"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906201564379754556/doragyurosu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドラギュロス
    **別名:** 冥雷竜
    **ランク:** Ｇ級
    **弱点属性:**   火 <:zfire:883120156916744312> と   水 <:zwater:883120128017965066>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    45     25      5       5     0     0     0   100
    \n   胴体          20    35     10     10       5     0     0     0     0
    \n   翼            40    10     15      5       5     0     0     0     0
    \n   鉤爪          25    35     40      5       5     0     0     0     0
    \n   脚            15    15     10     15       5     0     0     0     0
    \n   副尾          40    20     35     10       5     0     0     0     0
    \n   尻尾          45    25     25     10       5     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    50     30      5       5     0     0     0   100
    \n   胴体          30    40     15     10       5     0     0     0     0
    \n   翼            45    15     20      5       5     0     0     0     0
    \n   鉤爪          30    40     45      5       5     0     0     0     0
    \n   脚            15    15     10     15       5     0     0     0     0
    \n   副尾          45    25     40     10       5     0     0     0     0
    \n   尻尾          50    30     30     10       5     0     0     0     0
    ```"

end
    end
end