module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ドゥレムディラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/13/FrontierGen-Duremudira_Render_001.png/revision/latest?cb=20150710093248"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906202147002138724/duremudirafirstdistrict.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドゥレムディラ
    **別名:** 天廊の番人
    **ランク:** 天廊
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **状態異常:** 凍傷 <:frost:883123635764744212> と 壊毒 <:durepoison:883123342914236446>
    **属性:**  氷 <:zice:883119912283938816>
    **弱点部位:** ```
    \n                                  一区
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     35     15       5     5    15     0   100
    \n   腹            20    20     20     15       5     5    15     0     0
    \n   背中          20    20     20     15       5     5    15     0     0
    \n   尻尾          35    25     35     15       5     5    15     0     0
    \n   前脚          25    30     15     10       5     5    15     0     0
    \n   後脚          25    25     15     10       5     5    15     0     0
    \n   翼            35    30     15     10       5     5    15     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  二区 
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     35     15       5     5    15     0   100
    \n   腹            20    20     20     15       5     5    10     0     0
    \n   背中          20    20     20     15       5     5    10     0     0
    \n   尻尾          35    25     35     15       5     5    10     0     0
    \n   前脚          25    30     15     10       5     5    15     0     0
    \n   後脚          25    25     15     10       5     5    10     0     0
    \n   翼            35    30     15     10       5     5    15     0     0
    ```"

end
    end
end