module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :デュラガウア do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/21/FrontierGen-Dyuragaua_Render_001.png/revision/latest?cb=20140903215114"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906203003650990190/dyuragaua.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** デュラガウア
    **タイトル:**  氷狐竜
    **ランク:** HR1-4
    **弱い:**    龍<:zdragon:883119756528476161>,   火<:zfire:883120156916744312> と   雷<:zthunder:883120020312440852>
    **病気:** 凍傷<:frost:883123635764744212>, 睡眠<:zsleep:883122848888143892> と 気絶<:stun:883125464397398106>
    **要素:**  氷<:zice:883119912283938816>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    55     30     10       0    15    15     0   100
    \n   前脚          50    40     25     10       0    15    10     0     0
    \n   後脚          45    40     35     15       0    10    15     0     0
    \n   腹            25    20     30     15       0    10    20     0     0
    \n   背中          30    35     25     15       0    10    15     0     0
    \n   尻尾          20    15     20     15       0    10    25     0     0
    \n   尾先          55    45     35     10       0    15    20     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    60     35     15       0    10    20     0   100
    \n   前脚          55    45     30     15       0    10    15     0     0
    \n   後脚          45    40     50     10       0    15    10     0     0
    \n   腹            25    20     45     10       0    15    15     0     0
    \n   背中          30    35     40     10       0    15    10     0     0
    \n   尻尾          20    15     20     10       0    15    20     0     0
    \n   尾先          60    50     40     15       0    10    25     0     0
    ```"
    msg.respond "```
    \n                             肉質(回転攻撃時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    60     30     10       0    15    15     0   100  
    \n   前脚          55    45     25     10       0    15    10     0     0  
    \n   後脚          45    40     35     15       0    10    15     0     0  
    \n   腹            25    20     30     15       0    10    20     0     0  
    \n   背中          30    35     25     15       0    10    15     0     0  
    \n   尻尾          20    15     20     15       0    10    25     0     0  
    \n   尾先          60    50     35     10       0    15    20     0     0  
    ```"

end
      command :デュラガウア_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/9/99/FrontierGen-HC_Dyuragaua_Render_001.png/revision/latest?cb=20140902025350"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906203003650990190/dyuragaua.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** デュラガウア
    **タイトル:**  氷狐竜
    **ランク:** HR5
    **弱い:**    龍<:zdragon:883119756528476161>,   火<:zfire:883120156916744312> と   雷<:zthunder:883120020312440852>
    **病気:** 凍傷<:frost:883123635764744212>, 睡眠<:zsleep:883122848888143892> と 気絶<:stun:883125464397398106>
    **要素:**  氷<:zice:883119912283938816>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    45     20      5       0    10    10     0   100
    \n   前脚          40    30     15      5       0    10     5     0     0
    \n   後脚          35    30     25     10       0     5    10     0     0
    \n   腹            20    15     20     10       0     5    15     0     0
    \n   背中          25    30     15     10       0     5    10     0     0
    \n   尻尾          15    10     15     10       0     5    20     0     0
    \n   尾先          45    35     25      5       0    10    15     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    50     25     10       0     5    15     0   100
    \n   前脚          45    35     20     10       0     5    10     0     0
    \n   後脚          35    30     40      5       0    10     5     0     0
    \n   腹            20    15     35      5       0    10    10     0     0
    \n   背中          25    30     25      5       0    10     5     0     0
    \n   尻尾          15    10     15      5       0    10    15     0     0
    \n   尾先          50    40     30     10       0     5    20     0     0
    ```"
    msg.respond "```
    \n                             肉質(回転攻撃時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    50     20      5       0    10    10     0   100  
    \n   前脚          45    35     15      5       0    10     5     0     0  
    \n   後脚          35    30     25     10       0     5    10     0     0  
    \n   腹            20    15     15     10       0     5    15     0     0  
    \n   背中          25    30     20     10       0     5    10     0     0  
    \n   尻尾          15    10     15     10       0     5    20     0     0  
    \n   尾先          50    40     25      5       0    10    15     0     0  
    ```"

end
      command :デュラガウア_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/a/a8/FrontierGen-Dyuragaua_Render_003.png/revision/latest?cb=20140906015649"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906203003650990190/dyuragaua.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** デュラガウア
    **タイトル:**  氷狐竜
    **ランク:** Ｇ級
    **弱い:**    龍<:zdragon:883119756528476161>,   火<:zfire:883120156916744312> と   雷<:zthunder:883120020312440852>
    **病気:** 凍傷<:frost:883123635764744212>, 睡眠<:zsleep:883122848888143892> と 気絶<:stun:883125464397398106>
    **要素:**  氷<:zice:883119912283938816>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    55     30     10       0    30    20     0   100
    \n   前脚          50    30     25     10       0    30    15     0     0
    \n   後脚          45    40     35     15       0    10    15     0     0
    \n   腹            20    20     30     15       0    10    20     0     0
    \n   背中          30    35     25     15       0    10    15     0     0
    \n   尻尾          20    15     20     15       0    10    25     0     0
    \n   尾先          55    45     35     10       0    15    30     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    60     35     15       0    25    25     0   100
    \n   前脚          55    35     30     15       0    20    20     0     0
    \n   後脚          45    40     50     10       0    15    10     0     0
    \n   腹            20    20     45     10       0    15    15     0     0
    \n   背中          30    35     40     10       0    15    10     0     0
    \n   尻尾          20    15     20     10       0    15    20     0     0
    \n   尾先          60    50     40     15       0    10    35     0     0
    ```"
    msg.respond "```
    \n                             肉質(回転攻撃時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    60     30     10       0    30    20     0   100  
    \n   前脚          55    35     25     10       0    30    15     0     0  
    \n   後脚          45    40     35     15       0    10    15     0     0  
    \n   腹            25    20     30     15       0    10    20     0     0  
    \n   背中          30    35     25     15       0    10    15     0     0  
    \n   尻尾          20    15     20     15       0    10    25     0     0  
    \n   尾先          60    50     35     10       0    15    30     0     0    
    ```"

end
    end
end