module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer
      
      command :エルゼリオン do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/31/FrontierGen-Eruzerion_Render_001.png/revision/latest?cb=20170731142105"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906203764329943080/elzelion.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** エルゼリオン
    **別名:** 灼零龍
    **ランク:** Ｇ級
    **弱点属性:**   火 <:zfire:883120156916744312> と  氷 <:zice:883119912283938816>
    **状態異常:**   火属性やられ小 <:zfire:883120156916744312> と  氷属性やられ小 <:zice:883119912283938816>
    **属性:**   火 <:zfire:883120156916744312> と  氷 <:zice:883119912283938816>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     40     15      10    10     0    15   100
    \n   胴体          25    20     15      5       0     0     0     5     0
    \n   左前脚        30    30     20      0      15     0     0    20     0
    \n   右前脚        30    30     20     20       0    15     0     0     0
    \n   左後脚        20    20     15      0      10     0     0    15     0
    \n   右後脚        20    20     15     15       0    10     0     0     0
    \n   尻尾          30    10     25     10       5     5     0    10     0
    \n ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     35     10       5     5     0    10   100
    \n   胴体          20    15     15      5       0     0     0     5     0
    \n   左前脚        25    25     20      0      10     0     0    15     0
    \n   右前脚        25    25     20     15       0    10     0     0     0
    \n   左後脚        15    15     15      0       5     0     0    10     0
    \n   右後脚        15    15     15     10       0     5     0     0     0
    \n   尻尾          30    10     25      5       0     0     0     5     0
    ```"

end
    end
end