module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer
      
      command :ガルバダオラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/39/FrontierGen-Garuba_Daora_Render_001.png/revision/latest?cb=20140718114258"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906207098474491914/garubadaora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ガルバダオラ
    **タイトル:** 金塵龍
    **ランク:** HR5-剛種
    **弱い:**   雷 <:zthunder:883120020312440852>
    **病気:** 結晶 <:crystal:883123660225908757>
    **要素:** 風
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     25      0       0    15     0     0   100
    \n   腹            25    30     15      0       0    10     0     0     0
    \n   背中          35    40     15      0       0    15     0     0     0
    \n   尻尾          30    25     20      0       0    15     0     0     0
    \n   前脚          20    20     10      0       0     5     0     0     0
    \n   後脚          15    30     15      0       0     5     0     0     0
    \n   翼            35    30     10      0       0    20     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     35      0       0    25     0     0   100
    \n   腹            40    45     15      0       0    15     0     0     0
    \n   背中          50    15     20      0       0    20     0     0     0
    \n   尻尾          45    40     25      0       0    20     0     0     0
    \n   前脚          35    35     15      0       0    10     0     0     0
    \n   後脚          15    35     15      0       0    10     0     0     0
    \n   翼            60    35     15      0       0    30     0     0     0
    ```"

end
      command :ガルバダオラ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/39/FrontierGen-Garuba_Daora_Render_001.png/revision/latest?cb=20140718114258"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906207098474491914/garubadaora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ガルバダオラ
    **タイトル:** 金塵龍
    **ランク:** Ｇ級
    **弱い:**   雷 <:zthunder:883120020312440852>
    **病気:** 結晶 <:crystal:883123660225908757>
    **要素:** 風
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     25      0       0    15     0     0   100
    \n   腹            25    30     15      0       0    10     0     0     0
    \n   背中          35    40     15      0       0    15     0     0     0
    \n   尻尾          30    25     20      0       0    15     0     0     0
    \n   前脚          20    20     10      0       0     5     0     0     0
    \n   後脚          15    30     15      0       0     5     0     0     0
    \n   翼            35    30     10      0       0    20     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     35      0       0    25     0     0   100
    \n   腹            40    45     15      0       0    15     0     0     0
    \n   背中          50    15     20      0       0    20     0     0     0
    \n   尻尾          45    40     25      0       0    20     0     0     0
    \n   前脚          35    35     15      0       0    10     0     0     0
    \n   後脚          15    35     15      0       0    10     0     0     0
    \n   翼            60    35     15      0       0    30     0     0     0
    ```"

end
    end
end