module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ガスラバズラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/b1/FrontierGen-Gasurabazura_Render_001.png/revision/latest?cb=20150722093611"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906207752894959678/gasurabazura.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ガスラバズラ
    **別名:** 怒貌竜
    **ランク:** HR5-剛種
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 毒 <:zpoison:883122917976719451> と 気絶 <:stun:883125464397398106>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    45     30      0       0    40     0    10   100
    \n   首            30    25     35      0       0    25     0     5     0
    \n   前脚          50    35     40      0       0    50     0    15     0
    \n   後脚          25    40     25      0       0    25     0     0     0
    \n   腹            30    30     25      0       0    35     0     0     0
    \n   尻尾          25    30     30      0       0    30     0     0     0
    \n   背中          40    20     50      0       0    30     0    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     40      0       0    20     0     5   120
    \n   首            40    35     45      0       0     5     0     5     0
    \n   前脚          60    45     50      0       0    30     0    10     0
    \n   後脚          35    50     35      0       0     5     0     0     0
    \n   腹            40    40     35      0       0    15     0     0     0
    \n   尻尾          35    40     40      0       0    10     0     0     0
    \n   背中          50    30     60      0       0    10     0     5     0
    ```"

end
      command :ガスラバズラ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/7b/FrontierGen-Gasurabazura_Render_002.png/revision/latest?cb=20150722092854"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906207752894959678/gasurabazura.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ガスラバズラ
    **別名:** 怒貌竜
    **ランク:** Ｇ級
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 毒 <:zpoison:883122917976719451> と 気絶 <:stun:883125464397398106>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    35     20      0       0    30     0    10   100
    \n   首            20    15     25      0       0    15     0     5     0
    \n   前脚          40    25     30      0       0    45     0    15     0
    \n   後脚          15    30     15      0       0    15     0     0     0
    \n   腹            20    20     15      0       0    25     0     0     0
    \n   尻尾          15    20     20      0       0    20     0     0     0
    \n   背中          30    10     40      0       0    20     0    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    45     30      0       0    15     0     5   120
    \n   首            30    25     35      0       0     5     0     5     0
    \n   前脚          50    35     40      0       0    30     0    10     0
    \n   後脚          25    40     25      0       0     5     0     0     0
    \n   腹            30    30     25      0       0    10     0     0     0
    \n   尻尾          25    30     30      0       0     5     0     0     0
    \n   背中          40    20     50      0       0     5     0     5     0
    ```"

end
    end
end