module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ドスゲネポス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/f1/MH1-Gendrome_と_Genprey_Render_001.gif/revision/latest?cb=20131226144302"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906208114649489438/gendrome.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドスゲネポス
    **タイトル:** なし
    **弱い:**  氷 <:zice:883119912283938816>,   雷 <:zthunder:883120020312440852> と   火 <:zfire:883120156916744312>
    **病気:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106> (HC)
    **要素:** なし
    **弱点:** ```
    \n                                 HR1-4
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          90    90     90     35      10    40    10    50   100
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  HR5
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          75    55     40     15      15     5     0     5   100
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                Ｇ級
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          55    55     55     25       5    25     5    40   100
    ```"

end
    end
end