module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ゴゴモア do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/b0/FrontierGen-Gogomoa_Render_001.png/revision/latest?cb=20140106201408"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906209197992075284/gogomoa.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ゴゴモア
    **タイトル:** 跳緋獣
    **ランク:** HR1-4
    **弱い:**   火 <:zfire:883120156916744312> (HR1-4) と   氷 <:zice:883119912283938816> (HR1-5)
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            70    80     60     10       5    10     0    15   100
    \n   前脚          60    60     40     10       5    10     0    15     0
    \n   後脚          50    45     45     10       5    10     0    15     0
    \n   胴体          40    45     50     10       5    10     0    15     0
    \n   尻尾          70    60     80     15       5    10     0    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            210  240     60     10       5    10     0    15   200
    \n   前脚          180  180     40     10       5    10     0    15     0
    \n   後脚          150  135     45     10       5    10     0    15     0
    \n   胴体          120  135     50     10       5    10     0    15     0
    \n   尻尾          210  180     80     15       5    10     0    20     0
    ```"
    msg.respond "```
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            245  250     60     10       5    10     0    15   200
    \n   前脚          210  210     40     10       5    10     0    15     0
    \n   後脚          175  135     45     10       5    10     0    15     0
    \n   胴体          140  135     50     10       5    10     0    15     0
    \n   尻尾          245  195     80     15       5    10     0    20     0
    ```"

end
      command :ゴゴモア_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/c7/FrontierGen-HC_Gogomoa_Render_001.png/revision/latest?cb=20140821070646"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906209197992075284/gogomoa.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ゴゴモア
    **タイトル:** 跳緋獣
    **ランク:** HR5-剛種
    **弱い:**   火 <:zfire:883120156916744312> (HR1-4) と   氷 <:zice:883119912283938816> (HR1-5)
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    50     30      5       0     5     0    10   100
    \n   前脚          35    30     20      5       0     5     0    10     0
    \n   後脚          25    35     20      5       0     5     0    10     0
    \n   胴体          35    40     25      5       0     5     0    10     0
    \n   尻尾          40    30     45     10       0     5     0    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭           120   150     30      5       0     5     0    10   200
    \n   前脚         105    90     20      5       0     5     0    10     0
    \n   後脚          75   105     20      5       0     5     0    10     0
    \n   胴体         105   120     25      5       0     5     0    10     0
    \n   尻尾         120    90     45     10       0     5     0    15     0
    ```"
    msg.respond "```
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭           160   175     30      5       0     5     0    10   200
    \n   前脚         125   105     20      5       0     5     0    10     0
    \n   後脚          90   125     20      5       0     5     0    10     0
    \n   胴体         125   160     25      5       0     5     0    10     0
    \n   尻尾         140   105     45     10       0     5     0    15     0
    ```"

end
      command :ゴゴモア_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/03/FrontierGen-Gogomoa_Render_002.png/revision/latest?cb=20140106195051"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906209197992075284/gogomoa.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ゴゴモア
    **タイトル:** 跳緋獣
    **ランク:** Ｇ級
    **弱い:**   火 <:zfire:883120156916744312> (HR1-4) と   氷 <:zice:883119912283938816> (HR1-5)
    **病気:** 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30     10       5    10     0    20   100
    \n   前脚          30    30     20     10       5    10     0    20     0
    \n   後脚          25    20     20     10       5    10     0    20     0
    \n   胴体          30    35     25     10       5    10     0    20     0
    \n   尻尾          35    30     40     15       5    10     0    25     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭           105   120     30     10       5    10     0    20   200
    \n   前脚          90    90     20     10       5    10     0    20     0
    \n   後脚          75    60     20     10       5    10     0    20     0
    \n   胴体          90   105     25     10       5    10     0    20     0
    \n   尻尾         105    90     40     15       5    10     0    25     0
    ```"
    msg.respond "```
    \n                            肉質(カウンター：ダメージ４倍)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭           140   140     30     10       5    10     0    20   200
    \n   前脚         105   105     20     10       5    10     0    20     0
    \n   後脚         100    70     20     10       5    10     0    20     0
    \n   胴体         105   140     25     10       5    10     0    20     0
    \n   尻尾         140   105     40     15       5    10     0    25     0
    ```"

end
    end
end