module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :グラビモス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/b0/2ndGen-Gravios_Render_001.png/revision/latest?cb=20150303002203"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906212705201975346/gravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス
    **タイトル:** 鎧竜
    **ランク:** HR1-4
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5    40     5   150
    \n   首            30    30     20      0      30     5    20    10     0
    \n   背中          20    30     20      0      25     5    15    10     0
    \n   腹            25    30     30      0      35     5    35    15     0
    \n   尻尾          25    30     20      0      30     5    20    10     0
    \n   翼            20    20     20      0      20     5    15     5     0
    \n   脚            15    25     20      0      30     5    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20      0      15     5    40     5   150
    \n   首            30    30     20      0      30     5    20    10     0
    \n   背中          20    30     20      0      25     5    15    10     0
    \n   腹            80    80     75     15      50     5    50    15     0
    \n   尻尾          25    30     20      0      30     5    20    10     0
    \n   翼            20    20     20      0      20     5    15     5     0
    \n   脚            15    25     20      0      30     5    10     5     0
    ```"

end
      command :グラビモス_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/ef/FrontierGen-HC_Gravios_Render_001.png/revision/latest?cb=20140902010731"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906212705201975346/gravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス
    **タイトル:** 鎧竜
    **ランク:** HR5
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20    -10      15     5     5     5   150
    \n   首            10    30     30    -10      20     5     5     5     0
    \n   背中          20    30     20    -10      10     5     5     5     0
    \n   腹            20    30     20    -20      10    -5    20     5     0
    \n   尻尾          25    30     20    -10      15     5    10     5     0
    \n   翼            25    10     20    -10      15     5     5     5     0
    \n   脚            15    15     20     -5      10     5     5     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     20    -10      15     5     5     5   150
    \n   首            10    30     30    -10      20     5     5     5     0
    \n   背中          20    30     20    -10      10     5     5     5     0
    \n   腹            65    65     40     60      -5    20   -10     5     0
    \n   尻尾          25    30     20    -10      15     5    10     5     0
    \n   翼            25    10     20    -10      15     5     5     5     0
    \n   脚            15    15     20     -5      10     5     5     5     0
    ```"

end
      command :グラビモス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/5/5e/FrontierGen-Gravios_Render_002.png/revision/latest?cb=20140906144706"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906212705201975346/gravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グラビモス
    **タイトル:** 鎧竜
    **ランク:** Ｇ級
    **弱い:**   水 <:zwater:883120128017965066>
    **病気:** 睡眠 <:zsleep:883122848888143892>
    **要素:**   火 <:zfire:883120156916744312>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    40     30      0      20     5    40     5   150
    \n   首            50    30     20      0      30     5    20    10     0
    \n   背中          20    30     20      0      25     5    15    10     0
    \n   腹            25    30     35      0      35     5    35    15     0
    \n   尻尾          25    30     20      0      30     5    20    10     0
    \n   翼            20    20     20      0      20     5    15     5     0
    \n   脚            15    25     30      0      30     5    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    40     30      0      20     5    40     5   150
    \n   首            50    30     20      0      30     5    20    10     0
    \n   背中          20    30     20      0      25     5    15    10     0
    \n   腹            80    80     65     15      50     5    50    15     0
    \n   尻尾          25    30     20      0      30     5    20    10     0
    \n   翼            20    20     20      0      20     5    15     5     0
    \n   脚            15    25     30      0      30     5    10     5     0
    ```"

end
    end
end