module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :グレンゼブル do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/28/FrontierGen-Gurenzeburu_Render_001.png/revision/latest?cb=20140903095449"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906215807858638888/gurenzeburu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グレンゼブル
    **タイトル:** 蛮竜
    **ランク:** HR1-4
    **弱い:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **病気:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              15    30     15     10       0    15     0     0   100
    \n   翼              20    25     20     10       0    10    15     0     0
    \n  翼尾/先端        75    85     50     20       0    10    30     0     0
    \n   腹              40    20     25      0       0    10    15     0     0
    \n   背中            45    40     30      0       0    10     0     0     0
    \n   尻尾            55    60     20     10       0    10     0     0     0
    \n   脚              25    15     25      0       0    10     0     0     0
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              20    35     25     10       0    15     0     0   100
    \n   翼              25    30     20     10       0    10    15     0     0
    \n  翼尾/先端        85    95     55     20       0    10    30     0     0
    \n   腹              45    25     30      0       0    10    15     0     0
    \n   背中            50    45     35      0       0    10     0     0     0
    \n   尻尾            60    65     25     10       0    10     0     0     0
    \n   脚              30    20     30      0       0    10     0     0     0
    ```"

end
      command :グレンゼブル_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3e/FrontierGen-HC_Gurenzeburu_Render_001.png/revision/latest?cb=20140906150313"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906215807858638888/gurenzeburu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グレンゼブル
    **タイトル:** 蛮竜
    **ランク:** HR5-剛種
    **弱い:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **病気:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              10    25     15      5       0    10     0     0   100
    \n   翼              15    20     10      5       0     5    10     0     0
    \n  翼尾/先端        70    80     40     10       0     5    20     0     0
    \n   腹              35    15     20      0       0     5    10     0     0
    \n   背中            40    35     25      0       0     5     0     0     0
    \n   尻尾            50    55     15      5       0     5     0     0     0
    \n   脚              20    10     20      0       0     5     0     0     0
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              15    30     20      5       0    10     0     0   100
    \n   翼              20    25     15      5       0     5    10     0     0
    \n  翼尾/先端        80    90     45     10       0     5    20     0     0
    \n   腹              40    20     25      0       0     5    10     0     0
    \n   背中            45    40     30      0       0     5     0     0     0
    \n   尻尾            55    60     20      5       0     5     0     0     0
    \n   脚              25    15     25      0       0     5     0     0     0
    ```"

end
      command :グレンゼブル_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/9/90/FrontierGen-Gurenzeburu_Render_002.png/revision/latest?cb=20140903174343"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906215807858638888/gurenzeburu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** グレンゼブル
    **タイトル:** 蛮竜
    **ランク:** Ｇ級
    **弱い:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **病気:** 声帯麻痺 <:zpara:883122888692076545> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              15    30     15     10       0    35     0     0   100
    \n   翼              20    25     20     10       0    10    15     0     0
    \n  翼尾/先端        75    85     50     20       0    10    30     0     0
    \n   腹              40    20     25      0       0    10    15     0     0
    \n   背中            45    40     30      0       0    10     0     0     0
    \n   尻尾            55    60     30     10       0    10    10     0     0
    \n   脚              25    30     25      0       0    20     0     0     0
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位           切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  -------------- ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭              20    35     25     10       0    40     0     0   100
    \n   翼              25    30     20     10       0    10    20     0     0
    \n  翼尾/先端        85    95     55     20       0    10    30     0     0
    \n   腹              45    25     30      0       0    10    20     0     0
    \n   背中            50    45     35      0       0    10     0     0     0
    \n   尻尾            60    65     35     10       0    10    15     0     0
    \n   脚              30    30     30      0       0    20     0     0     0
    ```"

end
    end
end