module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ヒュジキキ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/31/FrontierGen-Hyujikiki_Render_003.png/revision/latest?cb=20140118104433"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906219098394996756/hyujikiki.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ヒュジキキ
    **タイトル:** 針纏竜
    **ランク:** Ｇ級
    **弱い:**   火 <:zfire:883120156916744312> と   雷 <:zthunder:883120020312440852>
    **病気:** 声帯麻痺 <:zpara:883122888692076545>, 毒 <:zpoison:883122917976719451> と 睡眠 <:zsleep:883122848888143892>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     40     40      15    25     0     0   100
    \n   胴体          35    35     20     30       5    15     0     0     0
    \n   前脚          20    25     20     15       5    25     0     0     0
    \n   後脚          30    40     20     20      10    20     0     0     0
    \n   尻尾          40    30     25     25      10    15     0     0     0
    \n   背中          25    20     25     20       5    10     0     0     0
    \n   尾先          55    30     30     30      10    20     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(防御状態)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    10     10     50       0    20     0     0     0
    \n   胴体          10    10     10     50       0    20     0     0     0
    \n   前脚          10    10     10     50       0    20     0     0     0
    \n   後脚          10    10     10     50       0    20     0     0     0
    \n   尻尾          10    10     10     50       0    20     0     0     0
    \n   背中          10    10     10     50       0    20     0     0     0
    \n   尾先          10    10     10     50       0    20     0     0     0
    ```"

end
    end
end