module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ドスイーオス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/25/MH1-Iodrome_と_Ioprey_Render_001.gif/revision/latest?cb=20131228013925"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906219923150352424/iodrome.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ドスイーオス
    **別名:** (?)
    **弱点属性:**   雷 <:zthunder:883120020312440852> と   水 <:zwater:883120128017965066>
    **状態異常:** 毒 <:zpoison:883122917976719451>
    **属性:** なし
    **弱点部位:** ```
    \n                                 HR1-4
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          80    80     80     20      30    30    10    10   100
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  HR5
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          75    70     45     10       5    10     0    15   100
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                Ｇ級
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   全身          50    50     50     10      30    30    10     5   100
    ```"

end
    end
end