module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :アクラ・ジェビア do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/c4/FrontierGen-Akura_Jebia_Render_001.png/revision/latest?cb=20140906054814"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906220551750692934/akurajebia.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ジェビア
    **別名:** 灰晶蠍
    **ランク:** HR1-4
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭             5    40     20      0       0     0     0     0   150
    \n   右爪           5    35     15      0       0     0     0     0     0
    \n   左爪           5    35     15      0       0     0     0     0     0
    \n   脚            30    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          15     5     30     15      15    15    15    15     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                  肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    10     20      0       0     0     0     0   150
    \n   右爪          35     5     15      0       0     0     0     0     0
    \n   左爪          35     5     15      0       0     0     0     0     0
    \n   脚            30    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          15    35     30     15      15    15    15    15     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                  肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    40     40      0       0     0     0     0   150  
    \n   右爪          35    35     40      0       0     0     0     0     0  
    \n   左爪          35    35     40      0       0     0     0     0     0  
    \n   脚            30    25     10      0       0     0     0     0     0  
    \n   胴体          20    20     10      0       0     0     0     0     0  
    \n   尻尾          30    15     30     15      15    15    15    15     0  
    \n   結晶           5    40     40      0       0     0     0     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            50    60     40      0       0     0     0     0   150  
    \n   右爪          50    50     40      0       0     0     0     0     0  
    \n   左爪          50    50     40      0       0     0     0     0     0  
    \n   脚            60    20     20      0       0     0     0     0     0  
    \n   胴体          50    50     80      0       0     0     0     0     0  
    \n   尻尾          15    15     50     20      20    20    20    20     0  
    \n   結晶          20    50     80      0       0     0     0     0     0  
    ```"

end
      command :アクラ・ジェビア_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/6/68/FrontierGen-HC_Akura_Jebia_Render_001.png/revision/latest?cb=20140423212651"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906220551750692934/akurajebia.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ジェビア
    **別名:** 灰晶蠍
    **ランク:** HR5
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    40     20      0       0     0     0     0   150
    \n   右爪          10    40     15      0       0     0     0     0     0
    \n   左爪          10    40     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          20     5     25     20      20    20    20    20     0
    \n   結晶           5    40     35      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                    肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    15     20      0       0     0     0     0   150
    \n   右爪          40    10     15      0       0     0     0     0     0
    \n   左爪          40    10     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾           5    50     30     20      20    20    20    20     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                    肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    40     35      0       0     0     0     0   150  
    \n   右爪          40    40     35      0       0     0     0     0     0  
    \n   左爪          40    40     35      0       0     0     0     0     0  
    \n   脚            25    25     10      0       0     0     0     0     0  
    \n   胴体          20    20     10      0       0     0     0     0     0  
    \n   尻尾          45    10     25     20      20    20    20    20     0  
    \n   結晶          10    45     35      0       0     0     0     0     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            45    55     40      0       0     0     0     0   150  
    \n   右爪          45    45     40      0       0     0     0     0     0  
    \n   左爪          45    45     40      0       0     0     0     0     0  
    \n   脚            55    15     25      0       0     0     0     0     0  
    \n   胴体          45    45     80      0       0     0     0     0     0  
    \n   尻尾          20    20     40     30      30    30    30    30     0  
    \n   結晶          20    50     70      0       0     0     0     0     0  
    ```"

end
      command :アクラ・ジェビア_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/fa/FrontierGen-Akura_Jebia_Render_002.png/revision/latest?cb=20141228122037"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906220551750692934/akurajebia.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ジェビア
    **別名:** 灰晶蠍
    **ランク:** Ｇ級
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    40     20      0       0     0     0     0   150
    \n   右爪          10    40     15      0       0     0     0     0     0
    \n   左爪          10    40     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          30    35     10      0       0     0     0     0     0
    \n   尻尾          20     5     25     20      20    20    20    20     0
    \n   結晶           5    40     35      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                    肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    15     20      0       0     0     0     0   150
    \n   右爪          50    10     15      0       0     0     0     0     0
    \n   左爪          50    10     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          30    35     10      0       0     0     0     0     0
    \n   尻尾           5    50     30     20      20    20    20    20     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                   肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    40     35      0       0     0     0     0   150  
    \n   右爪          40    40     35      0       0     0     0     0     0  
    \n   左爪          40    40     35      0       0     0     0     0     0  
    \n   脚            25    25     10      0       0     0     0     0     0  
    \n   胴体          30    35     10      0       0     0     0     0     0  
    \n   尻尾          45     5     25     20      20    20    20    20     0  
    \n   結晶          10    45     35      0       0     0     0     0     0    
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            45    55     40      0       0     0     0     0   150  
    \n   右爪          45    45     40      0       0     0     0     0     0  
    \n   左爪          45    45     40      0       0     0     0     0     0  
    \n   脚            40    15     25      0       0     0     0     0     0  
    \n   胴体          35    35     80      0       0     0     0     0     0  
    \n   尻尾          20    20     40     30      30    30    30    30     0  
    \n   結晶          20    40     70      0       0     0     0     0     0  
    ```"

end
    end
end