module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ジンオウガ do |msg|
        #msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/1b/FrontierGen-Zinogre_Render_001.png/revision/latest?cb=20150722093909"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906221323074818059/zinogre.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ジンオウガ
    **タイトル:**  雷狼竜
    **ランク:** HR5-遷悠
    **弱い:**  氷 <:zice:883119912283938816>
    **病気:**   雷属性やられ小 <:zthunder:883120020312440852>
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     42     10      10     0     5    15   100
    \n   胴体          21    21     18      5       5     0     5     5     0
    \n   背中          32    29     26     10      20     0     5    25     0
    \n   前脚          21    21     18      5       5     0     5    10     0
    \n   後脚          32    32     24      5       5     0     5    10     0
    \n   尻尾          30    25     25      5       5     0     5    10     0
    \n   尾先          21    19     10      7      10     0     5    12     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質(雷纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     42     10      10     0    10    15   120
    \n   胴体          25    25     21      5      10     0     5    10     0
    \n   背中          42    39     33     15      25     0     5    30     0
    \n   前脚          26    28     18      5       5     0     5    15     0
    \n   後脚          36    36     28     10      10     0     5    15     0
    \n   尻尾          30    25     25     10      10     0     5    15     0
    \n   尾先          21    19     10      7      10     0     5    12     0
    ```"

end
      command :ジンオウガ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/a/ac/MHP3-Zinogre_Render_004.png/revision/latest?cb=20150722094135"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906221323074818059/zinogre.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ジンオウガ
    **タイトル:**  雷狼竜
    **ランク:** Ｇ級-遷悠
    **弱い:**  氷 <:zice:883119912283938816>
    **病気:**   雷属性やられ小 <:zthunder:883120020312440852>
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            39    39     42     10      10     0     5    15   100
    \n   胴体          15    15     18      5       5     0     5     5     0
    \n   背中          27    24     21     10      20     0     5    25     0
    \n   前脚          15    18     18      5       5     0     5    10     0
    \n   後脚          27    27     21      5       5     0     5    10     0
    \n   尻尾          26    26     18      5       5     0     5    10     0
    \n   尾先          15    13     10      7      10     0     5    12     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質(雷纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            39    39     42     10      10     0    10    15   120
    \n   胴体          18    18     21      5      10     0     5    10     0
    \n   背中          42    39     33     15      25     0     5    30     0
    \n   前脚          26    28     18      5       5     0     5    15     0
    \n   後脚          30    30     24     10      10     0     5    15     0
    \n   尻尾          27    27     22     10      10     0     5    15     0
    \n   尾先          15    13     10      7      10     0     5    12     0
    ```"

end
    end
end