module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ケオアルボル do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/cc/FrontierGen-Keoaruboru_Render_001.png/revision/latest?cb=20170120045811"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906223325787877416/keoaruboru.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ケオアルボル
    **別名:** 焔嶽龍
    **ランク:** Ｇ級
    **弱点属性:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **状態異常:** なし
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    45     35      0      20     0    30    20   100
    \n   胴体          15    20     30      0      10     0    15     5     0
    \n   後脚          20    20     15      0      10     0     5     5     0
    \n   左前脚        35    35     25      0      15     0    10    20     0
    \n   右前脚        35    35     25      0      15     0    10    20     0
    \n   尻尾          40    15     20      0      15     0    10    20     0
    \n   ??            35    35     35      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質()
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            65    60     50     25       0    15    30     5   100
    \n   胴体          25    25     25     10       0     5     5     5     0
    \n   後脚          30    30     30     30       0    15    10     5     0
    \n   左前脚        35    35     35     10       0     5     5     5     0
    \n   右前脚        32    32     25     10       0     5     5     5     0
    \n   尻尾          20    26     20     15       0    10     5     0     0
    \n   ??            45    45     40     10       0    10     5     5     0
    ```"

end
    end
end