module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ナナ・テスカトリ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/a/a4/2ndGen-Lunastra_Render_001.png/revision/latest?cb=20150303040807"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906230339393978408/lunastra.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ナナ・テスカトリ
    **タイトル:** 炎妃龍
    **ランク:** HR1-4
    **弱い:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **病気:** なし
    **要素:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    70     30      0      15    10    25    35   100
    \n   腹            35    50     25      0      10     5    15    20     0
    \n   背中          20    25     30      0      10     5    15    20     0
    \n   尻尾          35    25     60      0      15     5    60    35     0
    \n   前脚          35    25     20      0      10     5    15    20     0
    \n   後脚          25    40     25      0      15     5    25    25     0
    \n   翼            20    15     20      0      10     5    15    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    70     20      0      25    10    35    10   100
    \n   腹            25    40     25      0      20     5    10    10     0
    \n   背中          20    25     20      0      20     5    10    10     0
    \n   尻尾          25    25     40      0      25     5    40    10     0
    \n   前脚          25    25     20      0      20     5    10    10     0
    \n   後脚          25    30     25      0      25     5    10    10     0
    \n   翼            20    15     20      0      20     5    10    10     0
    ```"

end
      command :ナナ・テスカトリ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/ef/FrontierGen-HC_Lunastra_Render_001.png/revision/latest?cb=20141118215930"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906230339393978408/lunastra.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ナナ・テスカトリ
    **タイトル:** 炎妃龍
    **ランク:** HR5-剛種
    **弱い:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **病気:** なし
    **要素:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     10      0      30    10    20    30   100
    \n   腹            15    25     15      0       5     5    15     0     0
    \n   背中          10    10     20      0       5     5    15     0     0
    \n   尻尾          30    25     30      0      30     5    10    40     0
    \n   前脚          20    20     15      0       0     5    10     0     0
    \n   後脚          20    20     15      0       0     5    10     0     0
    \n   翼            15    15     10      0       0     5    15     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    45     15      0      35    10    30    25   100
    \n   腹            20    30     10      0      10     5    15     0     0
    \n   背中          25    15     30      0      10     5    15     0     0
    \n   尻尾          30    35     25      0      40     5    20    50     0
    \n   前脚          25    20     10      0     -10     5    10     0     0
    \n   後脚          25    20     10      0     -10     5    10     0     0
    \n   翼            15    15     20      0       0     5    20     0     0
    ```"

end
      command :ナナ・テスカトリ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/f8/MHW-Lunastra_Render_001.png/revision/latest?cb=20180530122508"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906230339393978408/lunastra.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ナナ・テスカトリ
    **タイトル:** 炎妃龍
    **ランク:** Ｇ級
    **弱い:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816>
    **病気:** なし
    **要素:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    35     10      0      10    10    15    15   100
    \n   腹            10    15     10      0       5     5     0     5     0
    \n   背中          10     5     15      0       5     5     0     5     0
    \n   尻尾          35    25     30      0      10     5    25    20     0
    \n   前脚          10    15     10      0       5     5     5     5     0
    \n   後脚          15    15     10      0       5     5     5     5     0
    \n   翼            10    20     10      0       5     5    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    35     10      0      15    10    10     5   100
    \n   腹            10    15     10      0       5     5     0     0     0
    \n   背中          10     5     15      0       5     5     0     0     0
    \n   尻尾          30    25     30      0      20     5    15    10     0
    \n   前脚          10    15     10      0       5     5     5     0     0
    \n   後脚          15    15     10      0       5     5     5     0     0
    \n   翼            10    20     10      0       5     5     5     0     0
    ```"

end
    end
end