module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ミドガロン do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/4/4f/FrontierGen-Midogaron_Render_001.png/revision/latest?cb=20140909082705"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906231781831884810/midogaron.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ミドガロン
    **別名:** 爆狼
    **ランク:** Ｇ級
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:** 気絶 <:stun:883125464397398106>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     40      0      30     5     0    40   100
    \n   背中          45    40     40      0      15     5     0    25     0
    \n   胴体          30    25     20      0      20     5     0    15     0
    \n   脚            25    30     20      0      15     5     0    10     0
    \n   尻尾          35    30     30      0      10     5     0    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    50     45      0      35     5     0    50   100
    \n   背中          45    40     40      0      20     5     0    30     0
    \n   胴体          35    30     25      0      25     5     0    20     0
    \n   脚            30    35     25      0      20     5     0    15     0
    \n   尻尾          40    35     35      0      15     5     0    25     0
    ```"
    msg.respond "```
    \n                                肉質(咆哮時)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    45      5      0      30     5     0    40   100
    \n   背中          45    40      5      0      15     5     0    25     0
    \n   胴体          30    25      5      0      20     5     0    15     0
    \n   脚            25    30      5      0      15     5     0    10     0
    \n   尻尾          35    30      5      0      10     5     0    20     0
    ```"

end
    end
end