module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :極み襲うボガバドルム do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/34/FrontierGen-Peerless_Bogabadorumu_Render_001.png/revision/latest?cb=20190620102327"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906694991609470996/musou_bogabadorumu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 極み襲うボガバドルム
    **タイトル:** 爆霧竜
    **ランク:** 辿異
    **弱い:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **病気:**  爆破やられ <:blast:883124772450476042>
    **要素:**  爆破 <:blast:883124772450476042>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    30     25      5      15    10     5    20   100
    \n   背中          20    15     15      5      10    10     5     5     0
    \n   ??            10    20      5      5       5    10     5     5     0
    \n   腹            25    30     15      5      15    10     5    10     0
    \n   前脚          20    20     15      5      15    10     5    20     0
    \n   後脚          10    15     15      5      10    10     5     5     0
    \n   尻尾          25    15     20      5      15    10     5    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質()
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     30      5      20    10     5    30   100
    \n   背中          20    15     15      5      10    10     5     5     0
    \n   ??            10    20      5      5       5    10     5     5     0
    \n   腹            25    30     15      5      15    10     5    10     0
    \n   前脚          30    30     25      5      20    10     5    25     0
    \n   後脚          10    15     15      5      10    10     5     5     0
    \n   尻尾          35    20     25      5      20    10     5    25     0
    ```"

end
    end
end