module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :極み統べるグァンゾルム do |msg|
        # msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904405200004087880/EMDcrU-UUAEr0kh-removebg-preview.png"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906237074288558100/rulingguanzorumu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 極み統べるグァンゾルム
    **タイトル:** 帝征龍
    **ランク:** 極
    **弱い:**   水 <:zwater:883120128017965066> と    龍 <:zdragon:883119756528476161>
    **病気:** なし 
    **要素:**   火 <:zfire:883120156916744312> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    35     25      0      15    10    30    10   100
    \n   翼            25    20     20      0      10    10    20    15     0
    \n   後脚          10    15     15      0       5    10    10    10     0
    \n   尻尾          30     5     20      0       0    20    10     0     0
    \n   背中          10    20      5      0       5    10    20     5     0
    \n   腹            15    15     15      0      10    10    10     5     0
    \n   前脚          40    30     35     10       0    25    20     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            20    30     25      0      15    10    35    10   100  
    \n   翼            25    20     15      0      10    15    25    15     0  
    \n   後脚           5    15     10      0       5    10    10    10     0  
    \n   尻尾          30     5     20      0       0    25    10     0     0  
    \n   背中          10    20      5      0       5    10    25     5     0  
    \n   腹            15    10     15      0      10    10    10     5     0  
    \n   前脚          40    30     35     10       0    25    20     0     0  
    ```"

end
    end
end