module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :極み喰らうイビルジョー do |msg|
        # msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904480483180695612/8a224a1cgy1fn695i0srbj20kg0c5guq-removebg-preview.png"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906234847033446410/starvingdeviljho.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 極み喰らうイビルジョー
    **別名:** 鋏恐暴竜
    **ランク:** 極
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   雷 <:zthunder:883120020312440852>
    **状態異常:** 防御力低下 <:defdown:883125247551893514> と    龍属性やられ小 <:zdragon:883119756528476161>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    22     18     20      20    30    20    20   100
    \n   胸            41    41     39     15      15    25    15    15     0
    \n   胴体          15    15     15     20      20    30    20    20     0
    \n   前脚          18    18     21     15      15    25    15    15     0
    \n   後脚          20    20     14     20      20    30    20    20     0
    \n   尻尾          18    15     18     20      20    35    20    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            41    46     39      0       0     0     0     0   120
    \n   胸            34    32     32     15      15    25    15    15     0
    \n   胴体          14    14     11     20      20    30    20    20     0
    \n   前脚          18    18     21     15      15    25    15    15     0
    \n   後脚          19    19     14     20      20    30    20    20     0
    \n   尻尾          17    15     18     20      20    35    20    20     0
    ```"

end
    end
end