module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ナルガクルガ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/c1/2ndGen-Nargacuga_Render_001.png/revision/latest?cb=20150303084110"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906240355794575370/nargacuga.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ナルガクルガ
    **別名:** 迅竜
    **ランク:** HR5-遷悠
    **弱点属性:**   雷 <:zthunder:883120020312440852> と   火 <:zfire:883120156916744312>
    **状態異常:** 毒 <:zpoison:883122917976719451>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            42    42     45     20      10    25    15    15   100
    \n   胴体          22    22     24      5       0     5     5     0     0
    \n  翼？           18    10     18     25       5    25    15    10     0
    \n   前脚          30    30     22      5       5    10    10     5     0
    \n   後脚          30    30     32     10       0    15     5     0     0
    \n   尻尾          32    32     22      5       0    10    10     0     0
    \n   尾先          20    20     25     25       5    30    10    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            48    46     50     20      10    30    15    15   100
    \n   胴体          22    22     24      5       0     5     5     0     0
    \n  翼？           18    10     18     25       5    25    15    10     0
    \n   前脚          30    30     22      5       5    10    10     5     0
    \n   後脚          30    30     32     10       0    15     5     0     0
    \n   尻尾          32    32     22      5       0    15    10     0     0
    \n   尾先          20    20     25     25       5    30    10    10     0
    ```"

end
      command :ナルガクルガ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3b/FrontierGen-Nargacuga_Render_001.png/revision/latest?cb=20160415160532"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906240355794575370/nargacuga.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ナルガクルガ
    **別名:** 迅竜
    **ランク:** Ｇ級
    **弱点属性:**   雷 <:zthunder:883120020312440852> と   火 <:zfire:883120156916744312>
    **状態異常:** 毒 <:zpoison:883122917976719451>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            36    35     39     20      10    25    15    15   100
    \n   胴体          18    18     24      5       0     5     5     0     0
    \n  翼？           16    10     16     25       5    25    15    10     0
    \n   前脚          24    24     18      5       5    10    10     5     0
    \n   後脚          24    24     25     10       0    15     5     0     0
    \n   尻尾          26    25     18      5       0    10    10     0     0
    \n   尾先          18    18     22     25       5    30    10    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    38     42     20      10    30    15    15   100
    \n   胴体          18    18     24      5       0     5     5     0     0
    \n  翼？           16    10     16     25       5    25    15    10     0
    \n   前脚          24    24     18      5       5    10    10     5     0
    \n   後脚          24    24     25     10       0    15     5     0     0
    \n   尻尾          26    25     18      5       0    15    10     0     0
    \n   尾先          18    18     22     25       5    30    10    10     0
    ```"

end
    end
end