module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :エスピナス亜種 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/6/6c/FrontierGen-Espinas_Subspecies_Render_001.png/revision/latest?cb=20140906061556"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906242249665413190/orangeespinas.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** エスピナス亜種
    **別名:** 棘茶竜
    **ランク:** HR1-4
    **弱点属性:**   水 <:zwater:883120128017965066>
    **状態異常:** 毒 <:zpoison:883122917976719451> と 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    20     40     10      30    10     0     5   100
    \n   首            20    20     25     10      15    10     0     5     0
    \n   背中          10    15     25      5      15    10     0     5     0
    \n   腹            55    45     50      5      30     5     0     5     0
    \n   尻尾          25    25     25      5      25     5     0     5     0
    \n   翼            10    25     10      5      15    10     0     5     0
    \n   脚            20    20     45      5       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            70    40     25     10      40    15     0     5   100
    \n   首            60    35     20     10      20    10     0     5     0
    \n   背中          50    40     15      5      35    10     0     5     0
    \n   腹            80    50     40      5      45    15     0     5     0
    \n   尻尾          35    30     20      5      30     5     0     5     0
    \n   翼            40    35     20      5      20    10     0     5     0
    \n   脚            20    20     35      5      10     5     0     5     0
    ```"
    msg.respond "```
    \n                               肉質(溜め時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            70    40     20     10      40    15     0     5   100  
    \n   首            60    35     15     10      20    10     0     5     0  
    \n   背中          50    40     10      5      35    10     0     5     0  
    \n   腹            80    50     35      5      45    15     0     5     0  
    \n   尻尾          35    30     15      5      30     5     0     5     0  
    \n   翼            40    35     15      5      20    10     0     5     0  
    \n   脚            20    20     30      5      10     5     0     5     0 
    ```"

end
      command :エスピナス亜種_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/38/FrontierGen-HC_Espinas_Subspecies_Render_001_%28Edited%29.png/revision/latest?cb=20140113192403"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906242249665413190/orangeespinas.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** エスピナス亜種
    **別名:** 棘茶竜
    **ランク:** HR5
    **弱点属性:**   水 <:zwater:883120128017965066>
    **状態異常:** 毒 <:zpoison:883122917976719451> と 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    25     30     10      20     5     0     0   100
    \n   首            20    20     10      0       0     5     0     0     0
    \n   背中          10    15     25      5       0     5     0     5     0
    \n   腹            45    35     40      5      20     5     0     0     0
    \n   尻尾          25    20     30      5       5     5     0     5     0
    \n   翼            10    15     10      0      10    10     0     5     0
    \n   脚            20    20     40      0       0     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    45     30     10      20    10     0     0   100
    \n   首            45    35     10      0       5     5     0     0     0
    \n   背中          35    30     20      5       5     5     0     5     0
    \n   腹            70    40     35      5      20     5     0     0     0
    \n   尻尾          45    30     25      5       5     5     0     5     0
    \n   翼            40    35     15      0      10    10     0     5     0
    \n   脚            20    20     35      0       5     5     0     5     0
    ```"
    msg.respond "```
    \n                               肉質(溜め時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    45     20     10      20    10     0     0   100  
    \n   首            45    35     10      0       5     5     0     0     0  
    \n   背中          35    30     10      5       5     5     0     5     0  
    \n   腹            70    40     30      5      20     5     0     0     0  
    \n   尻尾          45    40     20      5       5     5     0     5     0  
    \n   翼            40    35     15      0      10    10     0     5     0  
    \n   脚            40    40     25      0       5     5     0     5     0 
    ```"

end
      command :エスピナス亜種_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e0/FrontierGen-Espinas_Subspecies_Render_002.png/revision/latest?cb=20151208205830"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906242249665413190/orangeespinas.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** エスピナス亜種
    **別名:** 棘茶竜
    **ランク:** Ｇ級
    **弱点属性:**   水 <:zwater:883120128017965066>
    **状態異常:** 毒 <:zpoison:883122917976719451> と 防御力低下 <:defdown:883125247551893514>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    20     35     10      25    10     0     5   100
    \n   首            20    20     25     10      10    10     0     5     0
    \n   背中          10    15     25      5      15    10     0     5     0
    \n   腹            45    40     40      5      25     5     0     5     0
    \n   尻尾          25    25     25      5      15     5     0     5     0
    \n   翼            10    25     10      5      10    10     0     5     0
    \n   脚            20    20     40      5       5     5     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    40     30     10      35    15     0     5   100
    \n   首            40    35     25     10      15    10     0     5     0
    \n   背中          25    30     20      5      25    10     0     5     0
    \n   腹            55    40     35      5      40    15     0     5     0
    \n   尻尾          35    25     25      5      20     5     0     5     0
    \n   翼            30    30     25      5      15    10     0     5     0
    \n   脚            20    20     30      5       5     5     0     5     0
    ```"
    msg.respond "```
    \n                               肉質(溜め時)							
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            70    40     20     10      40    15     0     5   100  
    \n   首            60    35     15     10      20    10     0     5     0  
    \n   背中          50    40     10      5      35    10     0     5     0  
    \n   腹            80    50     35      5      45    15     0     5     0  
    \n   尻尾          35    30     15      5      30     5     0     5     0  
    \n   翼            40    35     15      5      20    10     0     5     0  
    \n   脚            20    20     30      5      10     5     0     5     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質()						
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    20     35     10      25    10     0     5   100  
    \n   首            20    20     25     10      10    10     0     5     0  
    \n   背中          10    15     25      5      15    10     0     5     0  
    \n   腹            45    40     40      5      25     5     0     5     0  
    \n   尻尾          25    25     25      5      15     5     0     5     0  
    \n   翼            10    25     10      5      10    10     0     5     0  
    \n   脚            20    15     40      5       5     5     0     5     0 
    ```"
    msg.respond "```
    \n                                 肉質()						
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    50     35     10      35    15     0     5   100  
    \n   首            35    30     25     10      15    10     0     5     0  
    \n   背中          25    30     20      5      25    10     0     5     0  
    \n   腹            55    50     55      5      40    15     0     5     0  
    \n   尻尾          35    25     25      5      20     5     0     5     0  
    \n   翼            30    35     25      5      15    10     0     5     0  
    \n   脚            15    10     30      5       5     5     0     5     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質()						
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            75    75     60     10      40    15     0     5   100  
    \n   首            65    60     55     10      20    10     0     5     0  
    \n   背中          50    55     50      5      35    10     0     5     0  
    \n   腹            85    80     90      5      45    15     0     5     0  
    \n   尻尾          60    55     50      5      30     5     0     5     0  
    \n   翼            55    65     50      5      20    10     0     5     0  
    \n   脚            45    40     60      5      10     5     0     5     0  
    ```"

end
    end
end