module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :パリアプリア do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3b/FrontierGen-Pariapuria_Render_001.png/revision/latest?cb=20140810150419"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906243161079296020/pariapuria.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** パリアプリア
    **タイトル:** 呑竜
    **ランク:** HR1-4
    **弱い:**   火 <:zfire:883120156916744312> と   雷 <:zthunder:883120020312440852>
    **病気:** 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545>, 睡眠 <:zsleep:883122848888143892>, 一部アイテム使用不可 <:fart:883125077481246791> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    80     40     30       0     5     0     5   100
    \n   胴体          50    30     20     20       0    10     0     5     0
    \n   翼            30    50     25     10       0    25     0     5     0
    \n   脚            30    50     25     10       0    25     0     5     0
    \n   尻尾          40    20     75     20       0    20     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(満腹時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    80     40     40       0    20     0     5   100
    \n   胴体          50    30     20     50       0    20     0     5     0
    \n   翼            30    50     25     20       0    30     0     5     0
    \n   脚            30    50     25     20       0    30     0     5     0
    \n   尻尾          40    20     75     50       0    40     0     5     0
    ```"

end
      command :パリアプリア_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/29/FrontierGen-覇種_Pariapuria_Render_001.png/revision/latest?cb=20180209190326"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906243161079296020/pariapuria.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** パリアプリア
    **タイトル:** 呑竜
    **ランク:** HR5-覇種
    **弱い:**   火 <:zfire:883120156916744312> と   雷 <:zthunder:883120020312440852>
    **病気:** 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545>, 睡眠 <:zsleep:883122848888143892>, 一部アイテム使用不可 <:fart:883125077481246791> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    70     30     30       0     5     0     5   100
    \n   胴体          40    20     10     20       0    10     0     5     0
    \n   翼            20    40     15     10       0    25     0     5     0
    \n   脚            20    40     15     10       0    25     0     5     0
    \n   尻尾          30    10     65     20       0    20     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(満腹時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    70     30      5       0    30     0     5   100
    \n   胴体          40    20     10     10       0    20     0     5     0
    \n   翼            20    40     15     25       0    10     0     5     0
    \n   脚            20    40     15     25       0    10     0     5     0
    \n   尻尾          30    10     65     20       0    20     0     5     0
    ```"

end
      command :パリアプリア_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3f/FrontierGen-HC_Pariapuria_Render_001.png/revision/latest?cb=20140112104307"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906243161079296020/pariapuria.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** パリアプリア
    **タイトル:** 呑竜
    **ランク:** Ｇ級
    **弱い:**   火 <:zfire:883120156916744312> と   雷 <:zthunder:883120020312440852>
    **病気:** 毒 <:zpoison:883122917976719451>, 声帯麻痺 <:zpara:883122888692076545>, 睡眠 <:zsleep:883122848888143892>, 一部アイテム使用不可 <:fart:883125077481246791> と 気絶 <:stun:883125464397398106>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    60     40     30       0     5     0     5   100
    \n   胴体          30    30     20     20       0    10     0     5     0
    \n   翼            25    30     25     10       0    25     0     5     0
    \n   脚            25    30     25     10       0    25     0     5     0
    \n   尻尾          55    20     55     20       0    20     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(満腹時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    60     40     40       0    20     0     5   100
    \n   胴体          30    30     20     50       0    20     0     5     0
    \n   翼            25    30     25     20       0    30     0     5     0
    \n   脚            25    30     25     20       0    30     0     5     0
    \n   尻尾          55    20     55     50       0    40     0     5     0
    ```"

end
    end
end