module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer
      
      command :ラヴィエンテ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/09/FrontierGen-Laviente_Render_001.png/revision/latest?cb=20140906030804"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906261880111263794/raviente.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ラヴィエンテ
    **別名:** 大巌竜
    **ランク:** HR1-4
    **弱点属性:** なし
    **状態異常:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         60    60     60     20      20    20    20    20    10
    \n   頭            50    50     40     20      20    20    20    20    10
    \n   首            60    10     40     20      20    20    20    20     0
    \n   腹            50    50     30     20      20    20    20    20     0
    \n   背中          30    35     50     20      20    20    20    20     0
    \n   尻尾          40    40     30     20      20    20    20    20     0
    \n   尻尾          40    40     30     20      20    20    20    20     0    
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         50    50     50     20      20    20    20    20    10
    \n   頭            40    40     30     20      20    20    20    20    10
    \n   首            50    10     30     20      20    20    20    20     0
    \n   腹            40    40     20     20      20    20    20    20     0
    \n   背中          20    25     40     20      20    20    20    20     0
    \n   尻尾          30    30     25     20      20    20    20    20     0
    \n   尻尾          30    30     25     20      20    20    20    20     0
    ```"

end
      command :ラヴィエンテ狂暴期 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/f4/FrontierGen-Violent_Laviente_Render_001.png/revision/latest?cb=20140731004101"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906261880111263794/raviente.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ラヴィエンテ狂暴期
    **別名:** 大巌竜
    **ランク:** HR5
    **弱点属性:** なし
    **状態異常:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         60    60     60     20      20    20    20    20    10
    \n   頭            50    50     40     20      20    20    20    20    10
    \n   首            60    10     40     20      20    20    20    20     0
    \n   腹            50    50     30     20      20    20    20    20     0
    \n   背中          30    35     50     20      20    20    20    20     0
    \n   尻尾          40    40     30     20      20    20    20    20     0
    \n   尻尾          40    40     30     20      20    20    20    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         50    50     50     20      20    20    20    20    10
    \n   頭            40    40     30     20      20    20    20    20    10
    \n   首            50    10     30     20      20    20    20    20     0
    \n   腹            40    40     20     20      20    20    20    20     0
    \n   背中          20    25     40     20      20    20    20    20     0
    \n   尻尾          30    30     25     20      20    20    20    20     0
    \n   尻尾          30    30     25     20      20    20    20    20     0
    ```"

end
      command :ラヴィエンテ猛狂期_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/9/95/FrontierGen-Berserk_Laviente_Render_001.png/revision/latest?cb=20151208191613"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906262381355757629/berserkraviente.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ラヴィエンテ猛狂期
    **別名:** 大巌竜
    **ランク:** Ｇ級
    **弱点属性:** なし
    **状態異常:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         10    10     10     10      10    10    10    10    10
    \n   頭            50    50     40     25      25    25    25    25    10
    \n   首            60    10     40     25      25    25    25    25     0
    \n   腹            50    50     30     30      30    30    30    30     0
    \n   背中          30    35     50     35      35    35    35    35     0
    \n   尻尾          40    40     30     25      25    25    25    25     0
    \n   尻尾          10    10     10      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         10    10     10      5       5     5     5     5    10
    \n   頭            40    40     30     15      15    15    15    15    10
    \n   首            50    10     30     15      15    15    15    15     0
    \n   腹            40    40     20     20      20    20    20    20     0
    \n   背中          20    25     40     25      25    25    25    25     0
    \n   尻尾          30    30     25     15      15    15    15    15     0
    \n   尻尾          10    10     10      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                           肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         10    10     10     10      10    10    10    10    10  
    \n   頭            50    50     40     25      25    25    25    25    10  
    \n   首            60    10     40     25      25    25    25    25     0  
    \n   腹            50    50     30     30      30    30    30    30     0  
    \n   背中          30    35     50     35      35    35    35    35     0  
    \n   尻尾          40    40     30     25      25    25    25    25     0  
    \n   尻尾          80    80     80      0       0     0     0     0     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         10    10     10      5       5     5     5     5    10  
    \n   頭            40    40     30     15      15    15    15    15    10  
    \n   首            50    10     30     15      15    15    15    15     0  
    \n   腹            40    40     20     20      20    20    20    20     0  
    \n   背中          20    25     40     25      25    25    25    25     0  
    \n   尻尾          30    30     25     15      15    15    15    15     0  
    \n   尻尾          60    60     60      0       0     0     0     0     0 
    ```"
    msg.respond "```
    \n                           肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         80    80     80     30      30    30    30    30   100  
    \n   頭            70    70     60     30      30    30    30    30   100  
    \n   首            60    10     40     25      25    25    25    25     0  
    \n   腹            50    50     30     30      30    30    30    30     0  
    \n   背中          30    35     50     35      35    35    35    35     0  
    \n   尻尾          40    40     30     25      25    25    25    25     0  
    \n   尻尾          10    10     10      0       0     0     0     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                          肉質(蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         70    70     70     20      20    20    20    20   100  
    \n   頭            60    60     50     20      20    20    20    20   100  
    \n   首            50    10     30     15      15    15    15    15     0  
    \n   腹            40    40     20     20      20    20    20    20     0  
    \n   背中          20    25     40     25      25    25    25    25     0  
    \n   尻尾          30    30     25     15      15    15    15    15     0  
    \n   尻尾          10    10     10      0       0     0     0     0     0 
    ```"

end
      command :極ラヴィエンテ猛狂期 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/17/FrontierGen-Berserk_Laviente_Render_002.png/revision/latest?cb=20151208192235"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906262381355757629/berserkraviente.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ラヴィエンテ猛狂期[極]
    **別名:** 大巌竜
    **ランク:** Ｇ級
    **弱点属性:** なし
    **状態異常:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質(極)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         10    10     10     10      10    10    10    10    10
    \n   頭            35    35     30     25      25    25    25    25    10
    \n   首            40    10     25     25      25    25    25    25     0
    \n   腹            35    35     20     30      30    30    30    30     0
    \n   背中          20    25     35     35      35    35    35    35     0
    \n   尻尾          25    25     20     25      25    25    25    25     0
    \n   尻尾          10    10     10      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                            肉質(極蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   Fangs         10    10     10      5       5     5     5     5    10
    \n   頭            25    25     20     15      15    15    15    15    10
    \n   首            30    10     15     15      15    15    15    15     0
    \n   腹            25    25     10     20      20    20    20    20     0
    \n   背中          10    15     25     25      25    25    25    25     0
    \n   尻尾          15    15     10     15      15    15    15    15     0
    \n   尻尾          10    10     10      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                           肉質(極蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         10    10     10     10      10    10    10    10    10  
    \n   頭            35    35     30     25      25    25    25    25    10  
    \n   首            40    10     25     25      25    25    25    25     0  
    \n   腹            35    35     20     30      30    30    30    30     0  
    \n   背中          20    25     35     35      35    35    35    35     0  
    \n   尻尾          25    25     20     25      25    25    25    25     0  
    \n   尻尾          60    60     60      0       0     0     0     0     0    
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(極蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         10    10     10      5       5     5     5     5    10  
    \n   頭            25    25     20     15      15    15    15    15    10  
    \n   首            30    10     15     15      15    15    15    15     0  
    \n   腹            25    25     10     20      20    20    20    20     0  
    \n   背中          10    15     25     25      25    25    25    25     0  
    \n   尻尾          15    15     10     15      15    15    15    15     0  
    \n   尻尾          45    45     45      0       0     0     0     0     0 
    ```"
    msg.respond "```
    \n                          肉質(極蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         45    45     45     30      30    30    30    30   100  
    \n   頭            35    45     30     30      30    30    30    30   100  
    \n   首            40    10     25     25      25    25    25    25     0  
    \n   腹            35    35     20     30      30    30    30    30     0  
    \n   背中          20    25     30     35      35    35    35    35     0  
    \n   尻尾          25    25     20     25      25    25    25    25     0  
    \n   尻尾          10    10     10      0       0     0     0     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                          肉質(極蓄積耐性|怒り時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   Fangs         30    30     30     20      20    20    20    20   100  
    \n   頭            25    25     20     20      20    20    20    20   100  
    \n   首            30    10     15     15      15    15    15    15     0  
    \n   腹            25    25     10     20      20    20    20    20     0  
    \n   背中          10    15     20     25      25    25    25    25     0  
    \n   尻尾          15    15     10     15      15    15    15    15     0  
    \n   尻尾          10    10     10      0       0     0     0     0     0  
    ```"

end
    end
end