module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ルコディオラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/fb/FrontierGen-Rukodiora_Render_001.png/revision/latest?cb=20131231173829"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906266469938110544/rukodiora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ルコディオラ
    **別名:** 極龍
    **ランク:** HR1-4
    **弱点属性:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816> (肉質(怒り時時))
    **状態異常:** 異常磁場 <:zmagnet:883123524229820487>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    60     30      0       5     0     5    10   100
    \n   腹            35    40     45      0      10     0    15     5     0
    \n   背中          30    25     35      0      10     0    20     5     0
    \n   尻尾          55    50     40      0      10     0    10     5     0
    \n   前脚          30    35     30      0      10     0    15     5     0
    \n   後脚          30    35     30      0      10     0    10     5     0
    \n   翼            60    25     30      0       5     0    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(磁力纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    60     30      0      10     0     0     5   100
    \n   腹            35    40     45      0       5     0     0    10     0
    \n   背中          30    25     35      0       5     0     0    10     0
    \n   尻尾          55    50     40      0       5     0     0    10     0
    \n   前脚          30    35     30      0       5     0     0    10     0
    \n   後脚          30    35     30      0       5     0     0    10     0
    \n   翼            60    25     30      0      10     0     0     5     0
    ```"

end
      command :ルコディオラ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/24/FrontierGen-Rukodiora_Render_004.png/revision/latest?cb=20160709020453"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906266469938110544/rukodiora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ルコディオラ
    **別名:** 極龍
    **ランク:** HR5-剛種
    **弱点属性:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816> (肉質(怒り時時))
    **状態異常:** 異常磁場 <:zmagnet:883123524229820487>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    60     30      0       5     0     5    10   100
    \n   腹            30    40     35      0      10     0    15     5     0
    \n   背中          20    20     25      0      10     0    20     5     0
    \n   尻尾          45    40     40      0      10     0    10     5     0
    \n   前脚          25    25     20      0      10     0    15     5     0
    \n   後脚          25    25     20      0      10     0    10     5     0
    \n   翼            60    20     20      0       5     0    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(磁力纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    60     30      0      10     0     0    10   100
    \n   腹            30    40     35      0       5     0     0    10     0
    \n   背中          20    20     25      0       5     0     0    10     0
    \n   尻尾          45    40     40      0       5     0     0    10     0
    \n   前脚          25    25     20      0       5     0     0    10     0
    \n   後脚          25    25     20      0       5     0     0    10     0
    \n   翼            60    20     20      0      10     0     0    15     0
    ```"

end
      command :ルコディオラ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/2c/FrontierGen-Rukodiora_Render_003.png/revision/latest?cb=20140731005911"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906266469938110544/rukodiora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ルコディオラ
    **別名:** 極龍
    **ランク:** Ｇ級
    **弱点属性:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816> (肉質(怒り時時))
    **状態異常:** 異常磁場 <:zmagnet:883123524229820487>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0       5     0    10    10   100
    \n   腹            25    30     35      0      10     0    20     5     0
    \n   背中          15    15     25      0      10     0    25     5     0
    \n   尻尾          40    35     40      0      10     0    15     5     0
    \n   前脚          20    25     20      0      10     0    20     5     0
    \n   後脚          20    25     20      0      10     0    15     5     0
    \n   翼            45    25     20      0       5     0    15     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(磁力纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0       5     0     0    25   100
    \n   腹            25    30     35      0      10     0     0    15     0
    \n   背中          15    15     25      0      10     0     0    15     0
    \n   尻尾          40    35     40      0      10     0     0    15     0
    \n   前脚          20    25     20      0      10     0     0    15     0
    \n   後脚          20    25     20      0      10     0     0    15     0
    \n   翼            45    25     20      0       5     0     0    15     0
    ```"

end
    end
end