module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :錆びたクシャルダオラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/08/2ndGen-Rusted_Kushala_Daora_Render_001.png/revision/latest?cb=20150303073214"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906267015839379466/rustedkushaladaora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 錆びたクシャルダオラ
    **タイトル:** 鋼龍
    **ランク:** HR1-4
    **弱い:**   水 <:zwater:883120128017965066> と    龍 <:zdragon:883119756528476161>
    **病気:**  氷属性やられ小 <:zice:883119912283938816> と 防御力低下 <:defdown:883125247551893514>
    **要素:**    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     30     10       5    20    35     0   100
    \n   腹            35    50     25     10       5    15    20     0     0
    \n   背中          20    25     30     10       5    15    20     0     0
    \n   尻尾          35    30     40     10       5    30    35     0    10
    \n   前脚          30    25     20     10       5    15    20     0     0
    \n   後脚          30    35     25     10       5    15    30     0     0
    \n   翼            20    15     20     10       5    15    20     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(風纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     30     10       5    25    45     0   100
    \n   腹            25    40     25      5       0    20    10     0     0
    \n   背中          20    25     20      5       0    20    10     0     0
    \n   尻尾          35    30     40      5       0    30    40     0    10
    \n   前脚          25    25     20      5       0    20    10     0     0
    \n   後脚          30    35     25      5       0    20    10     0     0
    \n   翼            20    15     20      5       0    20    10     0     0
    ```"

end
      command :錆びたクシャルダオラ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/5/50/FrontierGen-HC_Rusted_Kushala_Daora_Render_001.png/revision/latest?cb=20140906152602"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906267015839379466/rustedkushaladaora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 錆びたクシャルダオラ
    **タイトル:** 鋼龍
    **ランク:** HR5-剛種
    **弱い:**   水 <:zwater:883120128017965066> と    龍 <:zdragon:883119756528476161>
    **病気:**  氷属性やられ小 <:zice:883119912283938816> と 防御力低下 <:defdown:883125247551893514>
    **要素:**    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     25      0       0    20    35     0   100
    \n   腹            30    45     20     10       5   -10   -15     0     0
    \n   背中          20    25     25     10       5   -10   -15     0     0
    \n   尻尾          30    25     35      0       0    30    35     0     0
    \n   前脚          25    20     20     10       5   -10   -15     0     0
    \n   後脚          25    30     25     10       5   -10   -15     0     0
    \n   翼            20    15     20      0       0    15    20     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(風纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     20      0       0    20    25     0   100
    \n   腹            25    25     15      5       0   -15   -20     0     0
    \n   背中          10    15     20      5       0   -15   -20     0     0
    \n   尻尾          25    20     30      0       0    30    25     0     0
    \n   前脚          20    15     10      5       0   -15   -20     0     0
    \n   後脚          20    25     15      5       0   -15   -20     0     0
    \n   翼            15    10     15      0       0    15    10     0     0
    ```"

end
    end
end