module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :セルレギオス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/24/MH4U-Seregios_Render_001.png/revision/latest?cb=20140906113402"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906267827990822943/seregios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** セルレギオス
    **別名:** 千刃竜
    **ランク:** HR5-遷悠
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 裂傷 <:bleed:883124203723825162>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            28    35     30      0      10    25     5    15   100
    \n   背中          25    20     20     15      10    15     5    15     0
    \n   腹            30    35     25      0      10    20     5    15     0
    \n   前脚          19    19     15      0      10    15     5    10     0
    \n   翼            26    26     26      0      10    15     5    10     0
    \n   後脚          35    30     30      0       5    20     5    15     0
    \n   尻尾          30    25     20      0       5    10     5     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            28    35     30      0      10    25     5    15   100
    \n   背中          25    20     20     15      10    15     5    15     0
    \n   腹            30    35     25      0      10    20     5    15     0
    \n   前脚          24    24     24      0      10    15     5    10     0
    \n   翼            26    26     26      0      10    15     5    10     0
    \n   後脚          35    30     30      0       5    20     5    15     0
    \n   尻尾          30    25     20      0       5    10     5     5     0
    ```"

end
      command :セルレギオス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/22/FrontierGen-Seregios_Render_001.png/revision/latest?cb=20180330122417"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906267827990822943/seregios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** セルレギオス
    **別名:** 千刃竜
    **ランク:** Ｇ級-遷悠
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 裂傷 <:bleed:883124203723825162>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    35     25      0      10    20     5    15   100
    \n   背中          15    15     20     10       5    10     5    10     0
    \n   腹            20    30     25      0      10    15     5    15     0
    \n   前脚          15    15     15      0       5    10     5    10     0
    \n   翼            22    22     22      0       5    10     5    10     0
    \n   後脚          35    30     30      0       5    15     5     5     0
    \n   尻尾          25    15     15      0       5    10     5     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    35     25      0      10    20     5    15   100
    \n   背中          15    15     20     10       5    10     5    10     0
    \n   腹            20    30     25      0      10    15     5    15     0
    \n   前脚          20    20     20      0       5    10     5    10     0
    \n   翼            22    22     22      0       5    10     5    10     0
    \n   後脚          35    30     30      0       5    15     5     5     0
    \n   尻尾          25    15     15      0       5    10     5     5     0
    ```"

end
    end
end