module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :シャガル・マガラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/be/MH4-Shagaru_Magala_Render_001.png/revision/latest?cb=20150303004807"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906271130577432576/shagarumagala.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** シャガル・マガラ
    **タイトル:** 天廻龍
    **ランク:** HR5-遷悠
    **弱い:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **病気:** 狂竜ウイルス <:frenzy:883124230357680199>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    45     35     25       0    15    30     5   100
    \n   胴体          25    25     25     10       0     5    10     5     0
    \n   翼脚          30    30     30     25       0    15    30     5     0
    \n   前脚          35    35     35     10       0     5    10     5     0
    \n   後脚          32    32     25     10       0     5    10     5     0
    \n   翼            20    26     20     15       0    10    20     0     0
    \n   尻尾          35    35     30     10       0    10    15     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(狂竜化)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    50     40     30       0    15    30     5   100
    \n   胴体          25    25     25     10       0     5    10     5     0
    \n   翼脚          30    30     30     30       0    15    30     5     0
    \n   前脚          35    35     35     10       0     5    10     5     0
    \n   後脚          32    32     25     10       0     5    10     5     0
    \n   翼            20    26     20     15       0    10    20     0     0
    \n   尻尾          35    35     30     10       0    10    15     5     0
    ```"

end
      command :シャガル・マガラ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e6/FrontierGen-Shagaru_Magala_%28True_肉質(狂竜化)_Mode%29_Render_001.png/revision/latest?cb=20170407121850"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906273216266399795/shagarumagalag.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** シャガル・マガラ
    **タイトル:** 天廻龍
    **ランク:** Ｇ級-遷悠
    **弱い:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **病気:** 狂竜ウイルス <:frenzy:883124230357680199>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            28    25     28     15       0    15    20     5   100
    \n   胴体          19    19     17      5       0     5     5     5     0
    \n   翼脚          21    21     25     10       0    15    15     5     0
    \n   前脚          15    15     15      5       0     5     5     5     0
    \n   後脚          12    12     12      5       0     5     5     5     0
    \n   翼            20    20     18     15       0     5     5     0     0
    \n   尻尾          25    17     28     10       0     5     5     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(狂竜化)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    33     35     25       0    15    25     5   100
    \n   胴体          19    19     17      5       0     5     5     5     0
    \n   翼脚          21    21     25     15       0    15    15     5     0
    \n   前脚          15    15     15      5       0     5     5     5     0
    \n   後脚          12    12     12      5       0     5     5     5     0
    \n   翼            20    20     18     15       0     5     5     0     0
    \n   尻尾          25    17     28     10       0     5     5     5     0
    ```"
    msg.respond "```
    \n                               True 肉質(狂竜化)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    33     35     25       0    10    25     5   100  
    \n   胴体          19    19     17      5       0     5     5     5     0  
    \n   翼脚          21    21     25     15       0    10    15     5     0  
    \n   前脚          15    15     15      5       0     5     5     5     0  
    \n   後脚          12    12     12      5       0     5     5     5     0  
    \n   翼            20    20     18     15       0     5     5     0     0  
    \n   尻尾          30    22     33     10       0     5     5     5     0  
    ```"

end
    end
end