module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ショウグンギザミ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/b2/2ndGen-Shogun_Ceanataur_Render_001.png/revision/latest?cb=20150303032835"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906281644271497248/shogunceanataur.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ショウグンギザミ
    **別名:** 鎌蟹
    **ランク:** HR1-4
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 毒 <:zpoison:883122917976719451> (HC)
    **属性:**   水 <:zwater:883120128017965066>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     35     10      10    35     0    20   100
    \n   胴体          35    40     25      5       5    20     0    10     0
    \n   ヤド          25    40     20      5       5    25     0    10     0
    \n   脚            25    30     30      5       5    15     0    10     0
    \n   鋏            20    30     15      5       5    20     0    10     0
    \n   手            20    35     25      5       5    15     0    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     40     10      10    35     0    20   100
    \n   胴体          40    50     30      5       5    20     0    10     0
    \n   ヤド          25    35     20      5       5    25     0    10     0
    \n   脚            35    50     30      5       5    15     0    10     0
    \n   鋏            25    35     15      5       5    20     0    10     0
    \n   手            30    35     25      5       5    15     0    10     0
    ```"

end
      command :ショウグンギザミ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e4/FrontierGen-HC_Shogun_Ceanataur_Render_001.png/revision/latest?cb=20140902022337"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906282180475486228/shogunceanataurhr5.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ショウグンギザミ
    **別名:** 鎌蟹
    **ランク:** HR5
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 毒 <:zpoison:883122917976719451> (HC)
    **属性:**   水 <:zwater:883120128017965066>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    40     10      5       0    15     0     0   100
    \n   胴体          35    30     10      5      10    -5    -5     5     0
    \n   ヤド          25    30     20     -5      10    -5     0    15     0
    \n   脚            25    30     30     10       5     0     0    10     0
    \n   鋏            20    30     35     10       5     0    15    10     0
    \n   手            20    35     25      5       5     0     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     10      5       0    15     0     0   100
    \n   胴体          40    40     10      5      10    -5    -5     5     0
    \n   ヤド          25    35     20     -5      10    -5     0    15     0
    \n   脚            35    40     30     10       5     0     0    10     0
    \n   鋏            25    35     40     10       5     0    15    10     0
    \n   手            30    35     20      5       5     0     0     5     0
    ```"

end
      command :ショウグンギザミ_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/77/MHGen-Shogun_Ceanataur_Render_001.png/revision/latest?cb=20150903093537"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906281644271497248/shogunceanataur.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ショウグンギザミ
    **別名:** 鎌蟹
    **ランク:** Ｇ級
    **弱点属性:**   雷 <:zthunder:883120020312440852> と  氷 <:zice:883119912283938816>
    **状態異常:** 毒 <:zpoison:883122917976719451> (HC)
    **属性:**   水 <:zwater:883120128017965066>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    55     35     10      10    30     0    20   100
    \n   胴体          40    35     25      5       5    20     0    10     0
    \n   ヤド          25    35     20      5       5    20     0    10     0
    \n   脚            25    25     15      5       5    15     0    20     0
    \n   鋏            20    30     20      5       5    20     0    10     0
    \n   手            20    35     25      5       5    15     0    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    60     40     10      10    30     0    20   100
    \n   胴体          45    40     30      5       5    20     0    10     0
    \n   ヤド          25    35     20      5       5    20     0    10     0
    \n   脚            30    40     20      5       5    15     0    20     0
    \n   鋏            25    35     20      5       5    20     0    10     0
    \n   手            30    35     30      5       5    15     0    10     0
    ```"

end
    end
end