module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :タイクンザムザ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/8/8e/FrontierGen-Taikun_Zamuza_Render_001.png/revision/latest?cb=20140831164324"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906284727907020860/taikunzamuza.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** タイクンザムザ
    **別名:** 多殻蟹
    **ランク:** HR1-4
    **弱点属性:**   火 <:zfire:883120156916744312> と  氷 <:zice:883119912283938816> (1st Form),  氷 <:zice:883119912283938816> と   火 <:zfire:883120156916744312> (2nd Form),   水 <:zwater:883120128017965066> と  氷 <:zice:883119912283938816> (3rd Form)
    **状態異常:** 毒 <:zpoison:883122917976719451> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   雷 <:zthunder:883120020312440852> (Final Form)
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    55     35     35      15     0     0    20   100
    \n   胴体          40    45     25     30      15     0     0    20     0
    \n   脚            45    40     35     30      20     0     0    25     0
    \n   右爪          35    50     40     25      20     0     0    25     0
    \n   左爪          50    35     45     25      20     0     0    20     0
    \n   尻尾          40    25     30     20      15     0     0    20     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(紅状態) 
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    60     40     25      15     0     0    20   100
    \n   胴体          45    45     25     20      15     0     0    25     0
    \n   脚            50    40     35     20      20     0     0    30     0
    \n   右爪          40    50     50     15      20     0     0    25     0
    \n   左爪          50    40     55     15      20     0     0    25     0
    \n   尻尾          40    25     30     15      15     0     0    20     0
    ```"
    msg.respond "```
    \n                                肉質(蒼状態) 																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    70     45      5      25     0     0    10   100  
    \n   胴体          45    50     25      5      25     0     0    10     0  
    \n   脚            55    45     45      5      30     0     0    15     0  
    \n   右爪          60    60     60      5      30     0     0    10     0  
    \n   左爪          70    55     60      5      30     0     0    10     0  
    ```"

end
      command :タイクンザムザ_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/11/FrontierGen-Taikun_Zamuza_Render_002.png/revision/latest?cb=20140821094339"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906284727907020860/taikunzamuza.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** タイクンザムザ
    **別名:** 多殻蟹
    **ランク:** HR5-剛種
    **弱点属性:**   火 <:zfire:883120156916744312> と  氷 <:zice:883119912283938816> (1st Form),  氷 <:zice:883119912283938816> と   火 <:zfire:883120156916744312> (2nd Form),   水 <:zwater:883120128017965066> と  氷 <:zice:883119912283938816> (3rd Form)
    **状態異常:** 毒 <:zpoison:883122917976719451> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:**   雷 <:zthunder:883120020312440852> (Final Form)
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    55     25     25       5     0     0    10   100
    \n   胴体          35    40     15     20       5     0     0    10     0
    \n   脚            40    35     25     20      10     0     0    15     0
    \n   右爪          25    40     30     15      10     0     0    15     0
    \n   左爪          40    25     35     15      10     0     0    10     0
    \n   尻尾          30    15     20     10       5     0     0    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(紅状態) 
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    60     30     15       5     0     0    10   100
    \n   胴体          40    45     20     10       5     0     0    15     0
    \n   脚            45    40     30     10      10     0     0    20     0
    \n   右爪          30    45     35      5      10     0     0    15     0
    \n   左爪          45    30     40      5      10     0     0    15     0
    \n   尻尾          35    20     25      5       5     0     0    10     0
    ```"
    msg.respond "```
    \n                                肉質(蒼状態) 																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            60    65     45      5      15     0     0     5   100  
    \n   胴体          40    50     25      5      15     0     0     5     0  
    \n   脚            55    40     30      5      20     0     0    10     0  
    \n   右爪          45    55     35      5      20     0     0     5     0  
    \n   左爪          55    55     40      5      20     0     0     5     0  
    ```"

end
    end
end