module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :テオ・テスカトル do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/e/e1/FrontierGen-Teostra_Render_001.png/revision/latest?cb=20141214141347"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286128225730641/teostra.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** テオ・テスカトル
    **別名:** 炎王龍
    **ランク:** HR1-4
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   水 <:zwater:883120128017965066>
    **状態異常:** なし
    **属性:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    70     30      0      35    10    25    15   100
    \n   腹            35    50     25      0      20     5    15    10     0
    \n   背中          20    25     30      0      20     5    15    10     0
    \n   尻尾          35    25     60      0      35     5    50    15     0
    \n   前脚          35    25     20      0      20     5    15    10     0
    \n   後脚          25    40     25      0      25     5    25    15     0
    \n   翼            20    15     20      0      20     5    15    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    70     20      0      10    10    25    25   100
    \n   腹            25    40     25      0      10     5    10    20     0
    \n   背中          20    25     20      0      10     5    10    20     0
    \n   尻尾          25    25     40      0      10     5    30    25     0
    \n   前脚          25    25     20      0      10     5    10    20     0
    \n   後脚          25    30     25      0      10     5    10    25     0
    \n   翼            20    15     20      0      10     5    10    20     0
    ```"

end
      command :テオ・テスカトル_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/c8/FrontierGen-覇種_Teostra_Render_001.png/revision/latest?cb=20140821073202"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286128225730641/teostra.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** テオ・テスカトル
    **別名:** 炎王龍
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   水 <:zwater:883120128017965066>
    **状態異常:** なし
    **属性:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **弱点部位:** 
    **ランク:** HR5
    ```
    \n                             HR5 / 肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    70     20      0      35     5    25    15   100
    \n   腹            30    40     20      0     -10     5   -10    -5     0
    \n   背中          20    20     20      0     -10     5   -10    -5     0
    \n   尻尾          35    20     40      0      35     5    50    15     0
    \n   前脚          35    25     20      0     -10     5   -10    -5     0
    \n   後脚          25    35     20      0     -10     5   -10    -5     0
    \n   翼            20    15     25      0      20     5    15    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             HR5 / 肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    65     20      0      10     5    25    25   100
    \n   腹            25    35     15      0      10     5   -15   -15     0
    \n   背中          20    20     15      0      10     5   -15   -15     0
    \n   尻尾          25    20     30      0      10     5    30    25     0
    \n   前脚          25    25     15      0      10     5   -15   -15     0
    \n   後脚          25    30     15      0      10     5   -15   -15     0
    \n   翼            20    15     25      0      10     5    10    20     0
    ```"
    msg.respond "**ランク:** 覇種 (HR6)``` 
    \n                          覇種 / 肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    45     20      0      35     5    25    15   100  
    \n   腹            30    40     20      0     -10     5   -10    -5     0  
    \n   背中          20    20     20      0     -10     5   -10    -5     0  
    \n   尻尾          35    20     40      0      35     5    50    15     0  
    \n   前脚          35    25     20      0     -10     5   -10    -5     0  
    \n   後脚          25    35     20      0     -10     5   -10    -5     0  
    \n   翼            20    15     25      0      20     5    15    10     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                        覇種 / 肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            40    35     20      0      10     5    25    25   100  
    \n   腹            25    35     15      0      10     5   -15   -15     0  
    \n   背中          20    20     15      0      10     5   -15   -15     0  
    \n   尻尾          25    20     30      0      10     5    30    25     0  
    \n   前脚          25    25     15      0      10     5   -15   -15     0  
    \n   後脚          25    30     15      0      10     5   -15   -15     0  
    \n   翼            20    15     25      0      10     5    10    20     0  
    ```"

end
      command :テオ・テスカトル_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/6/64/FrontierGen-覇種_Teostra_Render_002.png/revision/latest?cb=20140821092411"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286417834025050/teostrag.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** テオ・テスカトル
    **別名:** 炎王龍
    **ランク:** Ｇ級
    **弱点属性:**    龍 <:zdragon:883119756528476161> と   水 <:zwater:883120128017965066>
    **状態異常:** なし
    **属性:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            37    40     35      0      30    10    20    15   100
    \n   腹            20    10     15      0      20     5    10    10     0
    \n   背中          26    26     20      0      10     5    10     5     0
    \n   尻尾          35    26     40      0      30     5    35    15     0
    \n   前脚          25    28     15      0      15     5    15    10     0
    \n   後脚          20    30     10      0      20     5    20    15     0
    \n   翼            15    22     20      0      20     5    15    10     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(炎纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            47    50     45      0      10    10    20    20   100
    \n   腹            12     5     15      0      10     5     5    15     0
    \n   背中          17    26     20      0      10     5    10    10     0
    \n   尻尾          25    26     25      0      10     5    30    25     0
    \n   前脚          16    28     15      0      10     5    10    10     0
    \n   後脚          15    25     10      0      10     5    15    20     0
    \n   翼            13    22     20      0      10     5    10    15     0
    ```"
    msg.respond "```
    \n                               肉質(頭部破壊)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            42    45     40      0      30    10    20    15   100  
    \n   腹            25    10     20      0      20     5    10    10     0  
    \n   背中          30    28     25      0      10     5    10     5     0  
    \n   尻尾          40    28     45      0      30     5    35    15     0  
    \n   前脚          30    32     20      0      15     5    15    10     0  
    \n   後脚          25    35     15      0      20     5    20    15     0  
    \n   翼            20    25     25      0      20     5    15    10     0  
    ```"

end
    end
end