module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ティガレックス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/3e/2ndGen-Tigrex_Render_001.png/revision/latest?cb=20150303003930"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286996266299463/tigrex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ティガレックス
    **別名:** 轟竜
    **ランク:** HR1-4
    **弱点属性:**   雷<:zthunder:883120020312440852> と    龍<:zdragon:883119756528476161>
    **状態異常:** 雪だるま<:zsnowman:883124811746926592>,   火属性やられ小<:zfire:883120156916744312>,   水属性やられ小<:zwater:883120128017965066> と  氷属性やられ小<:zice:883119912283938816>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            65    55     40      0      15    30    20     5   110
    \n   首            50    25     20      0      10    20    15     5     0
    \n   腹            25    30     20     15      15    25    15    10     0
    \n   背中          45    40     25      0      15    25     5    10    10
    \n   尻尾          25    20     15      0       5    15    15     0     0
    \n   前脚          25    15     20      0      15    20    15    10     0
    \n   後脚          30    30     30      0       5    10     5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            80    70     45      0      15    35    20     5   150
    \n   首            55    30     20      0      10    20    15     5     0
    \n   腹            30    35     20     15      15    25    15    10     0
    \n   背中          50    45     20      0      15    25     5    10     0
    \n   尻尾          30    30     10      0       5    15    15     0     0
    \n   前脚          30    25     30      0      15    25    15    10     0
    \n   後脚          40    45     40      0       5    10     5     0     0
    ```"

end
      command :ティガレックス_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/5/5c/FrontierGen-HC_Tigrex_Render_001_%28Edited%29.png/revision/latest?cb=20140119100226"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286996266299463/tigrex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ティガレックス
    **別名:** 轟竜
    **ランク:** HR5
    **弱点属性:**   雷<:zthunder:883120020312440852> と    龍<:zdragon:883119756528476161>
    **状態異常:** 雪だるま<:zsnowman:883124811746926592>,   火属性やられ小<:zfire:883120156916744312>,   水属性やられ小<:zwater:883120128017965066> と  氷属性やられ小<:zice:883119912283938816>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    35     20      0      10    -5     5     5   110
    \n   首            35    25     20      0       5    25     5     5     0
    \n   腹            40    30     30      5      10     5    25     5     0
    \n   背中          40    40     25      0      25     5    -5     5    10
    \n   尻尾          25    20     30     10       0     0     0     5     0
    \n   前脚          25    15     15      0      -5     0     0     5     0
    \n   後脚          30    30     20      0      15     0     0     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            50    45     30      0      10    -5     5     5   150
    \n   首            40    30     20      0      10    30     5     5     0
    \n   腹            40    30     40      5      10     5    30     5     0
    \n   背中          40    40     20      0      30     5    -5     5     0
    \n   尻尾          20    30     10     10      -5     0     0     5     0
    \n   前脚          30    25     25      0       0     0    10     5     0
    \n   後脚          30    40     30      0      15     0     0     5     0
    ```"

end
      command :ティガレックス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/5/5b/2ndGen-Tigrex_Render_002.png/revision/latest?cb=20150303004546"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906286996266299463/tigrex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ティガレックス
    **別名:** 轟竜
    **ランク:** Ｇ級
    **弱点属性:**   雷<:zthunder:883120020312440852> と    龍<:zdragon:883119756528476161>
    **状態異常:** 雪だるま<:zsnowman:883124811746926592>,   火属性やられ小<:zfire:883120156916744312>,   水属性やられ小<:zwater:883120128017965066> と  氷属性やられ小<:zice:883119912283938816>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            45    40     30      0      15    30    20     5   110
    \n   首            30    25     20      0      10    20    15     5     0
    \n   腹            25    30     20     15      15    25    15    10     0
    \n   背中          35    40     25      0      15    25     5    10    10
    \n   尻尾          25    20     15      0       5    15    15     0     0
    \n   前脚          25    20     20      0      15    20    15    10     0
    \n   後脚          30    30     30      0       5    10     5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                  肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            55    50     35      0      15    35    20     5   150
    \n   首            45    35     20      0      10    20    15     5     0
    \n   腹            30    35     20     15      15    25    15    10     0
    \n   背中          40    40     20      0      15    25     5    10     0
    \n   尻尾          30    30     10      0       5    15    15     0     0
    \n   前脚          30    25     25      0      15    25    15    10     0
    \n   後脚          35    40     40      0       5    10     5     0     0
    ```"

end
    end
end