module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :トリドクレス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/7f/FrontierGen-Toridcless_Render_001.png/revision/latest?cb=20151208185412"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906288388972363826/toridcless.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** トリドクレス
    **タイトル:** 照雷鳥
    **ランク:** HR5-剛種
    **弱い:**   水 <:zwater:883120128017965066> と    龍 <:zdragon:883119756528476161>
    **病気:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    40     25      5      20     0    10     0   100
    \n   胸            35    15     15     20      10     0     5     0     0
    \n   背中          20    20     35     15      10     0     5     0     0
    \n   翼            25    15     10      0      15     0    20     0     0
    \n   脚            20    25     15      5      10     0    10     0     0
    \n   尻尾 Armor    40    40     40      0      20     0    20     0     0
    \n   尻尾          30    20     15      0      10     0     5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質()
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    50     35      5      20     0    10     0   100
    \n   胸            45    25     25     20      10     0     5     0     0
    \n   背中          30    30     45     15      10     0     5     0     0
    \n   翼            35    25     20      0      15     0    20     0     0
    \n   脚            30    35     25      5      10     0    10     0     0
    \n   尻尾 Armor    50    50     50      0      20     0    20     0     0
    \n   尻尾          40    30     25      0      10     0     5     0     0
    ```"

end
      command :トリドクレス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/f/f5/FrontierGen-Toridcless_Render_002.png/revision/latest?cb=20151208185508"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906288388972363826/toridcless.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** トリドクレス
    **タイトル:** 照雷鳥
    **ランク:** Ｇ級
    **弱い:**   水 <:zwater:883120128017965066> と    龍 <:zdragon:883119756528476161>
    **病気:** 気絶 <:stun:883125464397398106> と 声帯麻痺 <:zpara:883122888692076545>
    **要素:**   雷 <:zthunder:883120020312440852>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    35     20      5      20     0    10     0   100
    \n   胸            30    10     10     20      10     0     5     0     0
    \n   背中          15    15     30     15      10     0     5     0     0
    \n   翼            20    10      5      0      15     0    20     0     0
    \n   脚            15    20     10      5      10     0    10     0     0
    \n   尻尾 Armor    35    35     35      0      20     0    20     0     0
    \n   尻尾          25    15     10      0      10     0     5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                肉質()
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    45     30      5      20     0    10     0   100
    \n   胸            40    20     20     20      10     0     5     0     0
    \n   背中          25    25     40     15      10     0     5     0     0
    \n   翼            30    20     15      0      15     0    20     0     0
    \n   脚            25    30     20      5      10     0    10     0     0
    \n   尻尾 Armor    45    45     45      0      20     0    20     0     0
    \n   尻尾          35    25     20      0      10     0     5     0     0
    ```"

end
    end
end