module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :アクラ・ヴァシム do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/1/1e/FrontierGen-Akura_Vashimu_Render_001.png/revision/latest?cb=20140906052718"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906291587238223922/akuravashimu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ヴァシム
    **別名:** 尾晶蠍
    **ランク:** HR1-4
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    40     20      0       0     0     0     0   150
    \n   右爪          15    35     15      0       0     0     0     0     0
    \n   左爪          15    35     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     30      0       0     0     0     0     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                     肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    15     20      0       0     0     0     0   150
    \n   右爪          35    10     15      0       0     0     0     0     0
    \n   左爪          35    10     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     30      0       0     0     0     0     0
    \n   結晶           5    40     40      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                      肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    40     40      0       0     0     0     0   150  
    \n   右爪          35    35     40      0       0     0     0     0     0  
    \n   左爪          35    35     40      0       0     0     0     0     0  
    \n   脚            25    25     10      0       0     0     0     0     0  
    \n   胴体          15    20     10      0       0     0     0     0     0  
    \n   尻尾          30     5     30      0       0     0     0     0     0  
    \n   結晶           5    40     40      0       0     0     0     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            50    60     40      0       0     0     0     0   150  
    \n   右爪          50    50     40      0       0     0     0     0     0  
    \n   左爪          50    50     40      0       0     0     0     0     0  
    \n   脚            60    20     20      0       0     0     0     0     0  
    \n   胴体          50    50     80      0       0     0     0     0     0  
    \n   尻尾          40    20     50      0       0     0     0     0     0  
    \n   結晶          20    50     80      0       0     0     0     0     0  
    ```"

end
      command :アクラ・ヴァシム_HR do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/d/d4/FrontierGen-HC_Akura_Vashimu_Render_001.png/revision/latest?cb=20140817111724"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906291587238223922/akuravashimu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ヴァシム
    **別名:** 尾晶蠍
    **ランク:** HR5
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    35     20      0       0     0    -5    15   150
    \n   右爪          15    35     15      0       0    20   -10     0     0
    \n   左爪          15    35     15     20       0     0    -5     0     0
    \n   脚            25    25     10    -10       0   -10   -10   -10     0
    \n   胴体          20    20     10    -10       0   -10    -5   -10     0
    \n   尻尾          25     5     20      0       0     0   -10     0     0
    \n   結晶           5    35     30      0       0     0    -5     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                     肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    15     20      0       0     0    -5    20   150
    \n   右爪          35    10     15      0       0    25    -5     0     0
    \n   左爪          35    10     15     25       0     0    -5     0     0
    \n   脚            25    25     10    -10       0   -10    -5   -10     0
    \n   胴体          20    20     10    -15       0   -15    -5   -15     0
    \n   尻尾          30     5     25      0       0     0    -5     0     0
    \n   結晶           5    35     35      0       0     0    -5     0     0
    ```"
    msg.respond "```
    \n                      肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    35     30      0       0     0     0    25   150  
    \n   右爪          35    35     30      0       0    30    -5     0     0  
    \n   左爪          35    35     30     30       0     0     0     0     0  
    \n   脚            25    25     10    -10       0   -10    -5   -10     0  
    \n   胴体          20    20     10    -20       0   -20     0   -20     0  
    \n   尻尾          30     5     20      0       0     0    -5     0     0  
    \n   結晶           5    35     30      0       0     0     0     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            45    55     30      5      20     5     0     5   150  
    \n   右爪          45    45     30      5      20     5     0     5     0  
    \n   左爪          45    45     30      5      20     5     0     5     0  
    \n   脚            55    15     20      5      30     5     0     5     0  
    \n   胴体          45    45     70      5      30     5     0     5     0  
    \n   尻尾          35    15     40      5      30     5     0     5     0  
    \n   結晶          15    45     70      5      20     5     0     5     0  
    ```"

end
      command :アクラ・ヴァシム_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/bc/FrontierGen-Akura_Vashimu_Render_002.png/revision/latest?cb=20140118154626"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906291587238223922/akuravashimu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** アクラ・ヴァシム
    **別名:** 尾晶蠍
    **ランク:** Ｇ級
    **弱点属性:** なし
    **状態異常:** 結晶 <:crystal:883123660225908757> と 声帯麻痺 <:zpara:883122888692076545>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            15    40     20      0       0     0     0     0   150
    \n   右爪          15    35     15      0       0     0     0     0     0
    \n   左爪          15    35     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     40      0       0     0     0     0     0
    \n   結晶           5    40     60      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                      肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    15     20      0       0     0     0     0   150
    \n   右爪          35    15     15      0       0     0     0     0     0
    \n   左爪          35    15     15      0       0     0     0     0     0
    \n   脚            25    25     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     40      0       0     0     0     0     0
    \n   結晶           5    40     60      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                    肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    40     40      0       0     0     0     0   150  
    \n   右爪          35    35     40      0       0     0     0     0     0  
    \n   左爪          35    35     40      0       0     0     0     0     0  
    \n   脚            25    25     10      0       0     0     0     0     0  
    \n   胴体          15    20     10      0       0     0     0     0     0  
    \n   尻尾          30     5     40      0       0     0     0     0     0  
    \n   結晶           5    40     60      0       0     0     0     0     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            50    60     40      0       0     0     0     0   150  
    \n   右爪          50    50     40      0       0     0     0     0     0  
    \n   左爪          50    50     40      0       0     0     0     0     0  
    \n   脚            60    20     20      0       0     0     0     0     0  
    \n   胴体          50    50     80      0       0     0     0     0     0  
    \n   尻尾          40    20     60      0       0     0     0     0     0  
    \n   結晶          20    50     80      0       0     0     0     0     0  
    ```"

end
    end
end