module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ヴォージャン do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/cd/FrontierGen-Voljang_Render_001.png/revision/latest?cb=20160701073719"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906294032085434439/voljang.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ヴォージャン
    **別名:** 紅蓮獅子
    **ランク:** HR5-剛種
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:**   火属性やられ小 <:zfire:883120156916744312>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     35      0      20    20     0    25   100
    \n   前脚          15    30     15      0      15    10     0    20     0
    \n   後脚          30    25     25      0       0    15     0    10     0
    \n   胴体          20    10     20      0      10    15     0    15     0
    \n   尻尾          30    25     20      0      15    20     0    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     35      0      20    25     0    35   100
    \n   前脚          20    35     20      0      15    10     0    30     0
    \n   後脚          30    30     30      0       0    15     0    10     0
    \n   胴体          25    10     15      0      10    15     0    15     0
    \n   尻尾          35    30     25      0      15    25     0    25     0
    ```"

end
      command :ヴォージャン_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/cd/FrontierGen-Voljang_Render_001.png/revision/latest?cb=20160701073719"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906294032085434439/voljang.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ヴォージャン
    **別名:** 紅蓮獅子
    **ランク:** Ｇ級
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:**   火属性やられ小 <:zfire:883120156916744312>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0      20    20     0    25   100
    \n   前脚          10    25     10      0      15    10     0    20     0
    \n   後脚          25    20     20      0       0    15     0    10     0
    \n   胴体          15    10     15      0      10    15     0    15     0
    \n   尻尾          25    20     15      0      15    20     0    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35      0      20    25     0    35   100
    \n   前脚          20    30     15      0      15    10     0    30     0
    \n   後脚          25    25     25      0       0    15     0    10     0
    \n   胴体          15    10     10      0      10    15     0    15     0
    \n   尻尾          30    25     20      0      15    25     0    25     0
    ```"

end
    end
end