module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ミラボレアス祖龍 do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/2f/2ndGen-White_Fatalis_Render_001.png/revision/latest?cb=20130502195549"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906295143110426684/whitefatalis.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ミラボレアス(祖龍)
    **タイトル:** 祖龍
    **ランク:** HR1-4
    **弱い:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **病気:**   雷属性やられ小 <:zthunder:883120020312440852>
    **要素:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   顔            80    75     45     25      10    10    40    15   100
    \n   頭            50    55     30     20      10    10    30    15     0
    \n   背中/尻尾     10    20     20     25      10    10    10    15     0
    \n   首            30    25     25     20      10    10    30    15     0
    \n   胸            10    15     20     15      10    10    10    15     0
    \n   翼            30    25     20     25      10    10    10    15     0
    \n   胴体/手       20    20     20     20      10    10    20    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                      肉質(残り体力が50～20%)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   顔            10    10     10     10       5     5    10    10   100
    \n   頭            10    10     10     10       5     5    10    10     0
    \n   背中/尻尾     10    10     10     10       5     5    10    10     0
    \n   首            10    10     10     10       5     5    10    10     0
    \n   胸            10    10     10     10       5     5    10    10     0
    \n   翼            10    10     10     10       5     5    10    10     0
    \n   胴体/手       10    10     10     10       5     5    10    10     0
    ```"

end
      command :ミラボレアス祖龍_G do |msg|
        # msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/904450553915011172/FrontierGen-G_White_Fatalis_Screen弾_003-removebg-preview.png"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906295519867981834/whitefatalisg.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** ミラボレアス(祖龍)
    **タイトル:** 祖龍
    **ランク:** Ｇ級
    **弱い:**    龍 <:zdragon:883119756528476161> と   火 <:zfire:883120156916744312>
    **病気:**   雷属性やられ小 <:zthunder:883120020312440852>
    **要素:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   顔            25    35     30     20      10    10    30    15   100
    \n   頭            30    20     20     15      10    10    15    15     0
    \n   背中/尻尾     20    15     10     20      10    10    10    15     0
    \n   首            15    20     15     15      10    10    15    15     0
    \n   胸            25    20     25     10      10    10    10    15     0
    \n   翼            20    15     10     20      10    10    10    15     0
    \n   胴体/手       15    15     15     15      10    10    10    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                          肉質(残り体力が50～20%)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   顔            30    40     35     25       5   -15    35    10   100
    \n   頭            35    25     25     20       5   -10    15     5     0
    \n   背中/尻尾     20    15     10     20       5    -5     5     5     0
    \n   首            20    25     20     15       5   -10    15     5     0
    \n   胸            30    25     30     10       5   -10    20     5     0
    \n   翼            25    20     15     25       5    -5     5     5     0
    \n   胴体/手       15    15     15     15       5   -10    15     5     0
    ```"

end
    end
end