module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種バルラガル do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/32/FrontierGen-Zenith_Baruragaru_Render_001.png/revision/latest?cb=20180909100008"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906326961645813830/zenith_baruragaru.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種バルラガル
    **タイトル:** 喰血竜
    **ランク:**  辿異
    **弱い:**   火 <:zfire:883120156916744312> と   雷 <:zthunder:883120020312440852>
    **病気:** 水属性やられ【特大】 <:zwater:883120128017965066> と 裂傷 <:bleed:883124203723825162>
    **要素:**   水 <:zwater:883120128017965066>
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭           100   100    100    100     100   100   100   100   100
    \n   舌           100   100    100    100     100   100   100   100   100
    \n   首           100   100    100    100     100   100   100   100     0
    \n   胴体         100   100    100    100     100   100   100   100     0
    \n   前脚         100   100    100    100     100   100   100   100     0
    \n   後脚         100   100    100    100     100   100   100   100     0
    \n   尻尾         100   100    100    100     100   100   100   100     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(吸血中？)    
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30     20       0    15    15     0   100
    \n   舌            40    45     40     30       0    40    20     0   100
    \n   首            20    20     20     20       0    15    15     0     0
    \n   胴体          35    30     30     20       0    15    15     0     0
    \n   前脚          30    35     30     20       0    15    15     0     0
    \n   後脚          30    35     30     20       0    15    15     0     0
    \n   尻尾          40    25     30     30       0    20    15     0     0
    ```"
    msg.respond "```
    \n                              肉質(毒麻痺状態)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            20    25     25     15       0    15    10     0   100  
    \n   舌            30    30     30     20       0    25    15     0   100  
    \n   首            20    15     15      5       0    15    10     0     0  
    \n   胴体          15    25     10      5       0    15    10     0     0  
    \n   前脚          20    25     20      5       0    15    10     0     0  
    \n   後脚          10    10     10      5       0    10    10     0     0  
    \n   尻尾          25    15     20     15       0    15    10     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                 肉質(粘液状態？)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            25    30     30     20       0    10    10     0   100  
    \n   舌            35    35     35     25       0    15    15     0   100  
    \n   首            20    15     15     15       0     5    10     0     0  
    \n   胴体          15    25     10     15       0     5    10     0     0  
    \n   前脚          20    25     20     15       0     5    10     0     0  
    \n   後脚          10    10     10     10       0     5    10     0     0  
    \n   尻尾          25    15     20     20       0    10    10     0     0  
    ```"

      end
    end
end