module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種ギアオルグ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/3/38/FrontierGen-Zenith_Giaorugu_Render_001.png/revision/latest?cb=20170424072624"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906340927629590569/zenith_giaorugu.png"
        msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種ギアオルグ
    **別名:**  氷獰竜
    **ランク:** 辿異
    **弱点属性:**   火 <:zfire:883120156916744312>
    **状態異常:** 氷属性やられ【特大】 <:zice:883119912283938816>, 雪だるま <:zsnowman:883124811746926592> と 防御力低下 <:defdown:883125247551893514>
    **属性:**  氷 <:zice:883119912283938816>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     25     20       0    10     5     0   100
    \n   右脚          15    15     10     15       0     5    10     0     0
    \n   左脚          15    15     10     15       0     5    10     0     0
    \n   氷尾          15    20     10     50       0    10     5     0     0
    \n   胴体          20    25     20     10       0     5     5     0     0
    \n   尻尾          25    20     15     20       0    10     5     0     0
    \n   尾先端        30    25     20     25       0     5    10     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時1)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    30     30     20       0    10     5     0   100
    \n   右脚          15    15     10     15       0     5    10     0     0
    \n   左脚          15    15     10     15       0     5    10     0     0
    \n   氷尾          20    25     15     50       0    10     5     0     0
    \n   胴体          25    30     25     10       0     5     5     0     0
    \n   尻尾          30    25     20     25       0    10     5     0     0
    \n   尾先端        35    30     25     30       0     5    10     0     0
    ```"
    msg.respond "```
    \n                                 肉質(怒り時2)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     35     20       0    10     5     0   100  
    \n   右脚          15    20     10     15       0     5    10     0     0  
    \n   左脚          15    20     10     15       0     5    10     0     0  
    \n   氷尾          20    25     15     50       0    10     5     0     0  
    \n   胴体          25    30     25     10       0     5     5     0     0  
    \n   尻尾          35    25     20     30       0    10    10     0     0  
    \n   尾先端        40    30     30     35       0     5     5     0     0  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                                 肉質(怒り時3)								
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     35     25       0    10     5     0   100  
    \n   右脚          15    20     10     15       0    15    20     0     0  
    \n   左脚          15    20     10     15       0     5    10     0     0  
    \n   氷尾          20    25     15     50       0    10     5     0     0  
    \n   胴体          25    30     25     15       0     5     5     0     0  
    \n   尻尾          35    25     20     35       0    10    10     0     0  
    \n   尾先端        45    30     30     40       0    10    10     0     0  
    ```"

    end
  end
end