module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種ヒュジキキ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/b3/FrontierGen-Zenith_Hyujikiki_Render_001.png/revision/latest?cb=20170424072622"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906343637569396796/zenith_hyujikiki.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種ヒュジキキ
    **別名:** 針纏竜
    **ランク:** 辿異
    **弱点属性:**   火 <:zfire:883120156916744312>
    **状態異常:** 声帯麻痺 <:zpara:883122888692076545> と 裂傷 <:bleed:883124203723825162>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     35     30      15    25     0     0   100
    \n   胴体          25    35     20     20       5    15     0     0     0
    \n   前脚          15    15     15     10       5    20     0     0     0
    \n   後脚          25    25     15     15      10    15     0     0     0
    \n   尻尾          35    20     25     20      10    10     0     0     0
    \n   背中          25    25     25     20       5    10     0     0     0
    \n   尾先          45    20     30     25      10    15     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(防御状態)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    10     10     40       0    15     0     0     0
    \n   胴体          10    10     10     40       0    15     0     0     0
    \n   前脚          10    10     10     40       0    15     0     0     0
    \n   後脚          10    10     10     40       0    15     0     0     0
    \n   尻尾          10    10     10     40       0    15     0     0     0
    \n   背中          10    10     10     40       0    15     0     0     0
    \n   尾先          10    10     10     40       0    15     0     0     0
    ```"

      end
    end
end