module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種イナガミ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/26/FrontierGen-Zenith_Inagami_Render_002.png/revision/latest?cb=20171027165301"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906343974938214418/zenith_inagami.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種イナガミ
    **タイトル:** 雅翁龍
    **ランク:** 辿異
    **弱い:**   火 <:zfire:883120156916744312>
    **病気:** 熟睡 <:zsleep:883122848888143892>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    45     35     30       0    15    15     0   100
    \n   胴体          15    20      5      5       0     5    10     0     0
    \n   右前脚        20    25     20     15       0    15     5     0     0
    \n   左前脚        20    25     20     15       0    15     5     0     0
    \n   右後脚        25    20     20     15       0    15     5     0     0
    \n   左後脚        25    20     20     15       0    15     5     0     0
    \n   尻尾          45    30     30     35       0    20    15     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                               肉質(泥着)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    25     20     20       0    10    10     0   100
    \n   胴体          15    20      5      5       0     5    10     0     0
    \n   右前脚        15    15     15     10       0    10     5     0     0
    \n   左前脚        15    15     15     10       0    10     5     0     0
    \n   右後脚        15    15     15     10       0    10     5     0     0
    \n   左後脚        15    15     15     10       0    10     5     0     0
    \n   尻尾          20    15     15     25       0    15    10     0     0
    ```"

      end
    end
end