module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種アクラ・ヴァシム do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/2/20/FrontierGen-Zenith_Akura_Vashimu_Render_001.png/revision/latest?cb=20161105120356"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906350381066514482/zenith_akuravashimu.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種アクラ・ヴァシム
    **タイトル:** 尾晶蠍
    **ランク:** Ｇ級
    **弱い:** なし
    **病気:** 結晶 <:crystal:883123660225908757> と 結晶麻痺やられ <:zpara:883122888692076545>
    **要素:** なし
    **弱点:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    35     15      0       0     0     0     0   150
    \n   右爪          10    35     15      0       0     0     0     0     0
    \n   左爪          10    35     15      0       0     0     0     0     0
    \n   脚            20    20     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     35      0       0     0     0     0     0
    \n   結晶           5    35     45      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                    肉質(1段破壊[※破壊した部位のみ変化])
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    10     15      0       0     0     0     0   150
    \n   右爪          35    10     15      0       0     0     0     0     0
    \n   左爪          35    10     15      0       0     0     0     0     0
    \n   脚            20    20     10      0       0     0     0     0     0
    \n   胴体          20    20     10      0       0     0     0     0     0
    \n   尻尾          30     5     35      0       0     0     0     0     0
    \n   結晶           5    35     45      0       0     0     0     0     0
    ```"
    msg.respond "```
    \n                    肉質(2段破壊[※破壊した部位のみ変化])																	
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    35     35      0       0     0     0     0   150  
    \n   右爪          35    35     30      0       0     0     0     0     0  
    \n   左爪          35    35     30      0       0     0     0     0     0  
    \n   脚            20    20     10      0       0     0     0     0     0  
    \n   胴体          20    20     10      0       0     0     0     0     0  
    \n   尻尾          30     5     35      0       0     0     0     0     0  
    \n   結晶           5    35     45      0       0     0     0     0     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                            肉質(転倒中)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            35    40     35      0       0     0     0     0   150  
    \n   右爪          35    35     35      0       0     0     0     0     0  
    \n   左爪          35    35     35      0       0     0     0     0     0  
    \n   脚            35    15     15      0       0     0     0     0     0  
    \n   胴体          35    35     35      0       0     0     0     0     0  
    \n   尻尾          40    20     35      0       0     0     0     0     0  
    \n   結晶          15    35     45      0       0     0     0     0     0  
    ```"

      end
    end
end