module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種グラビモス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/8/83/FrontierGen-Zenith_Gravios_Render_001.png/revision/latest?cb=20180909095416"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906341458028662864/zenith_gravios.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種グラビモス
    **別名:** 鎧竜
    **ランク:** 辿異
    **弱点属性:**   水 <:zwater:883120128017965066>
    **状態異常:** 火属性やられ【特大】 <:zfire:883120156916744312>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     30      0      20     0    20    25   100
    \n   首            30    10     15      0      10     0     5     5     0
    \n   背中          10    15     15      0      10     0    10     5     0
    \n   腹            20    25     10      0      10     0    10     5     0
    \n   尻尾          30    15     20      0      10     0     5     5     0
    \n   翼            20    15     10      0      10     0    10     5     0
    \n   脚            15    15     10      0       5     0    10     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                           肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     30      0      30     0    20    25   100
    \n   首            30    10     15      0      10     0     5     5     0
    \n   背中          15    20     20      0      25     0    15    10     0
    \n   腹            25    30     15      0      25     0    15    10     0
    \n   尻尾          30    15     20      0      10     0     5     5     0
    \n   翼            20    20     10      0      10     0    10     5     0
    \n   脚            15    15     10      0       5     0    10     5     0
    ```"
    msg.respond "```
    \n                           肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶  
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            20    35     30      0      30     0    20    25   100  
    \n   首            30    10     15      0      10     0     5     5     0  
    \n   背中          30    40     20      0      25     0    15    10     0  
    \n   腹            25    30     15      0      25     0    15    10     0  
    \n   尻尾          30    15     20      0      10     0     5     5     0  
    \n   翼            20    20     10      0      10     0    10     5     0  
    \n   脚            15    15     10      0       5     0    10     5     0          
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                           肉質(腹部破壊後)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            20    35     30      0      30     0    20    25   100  
    \n   首            30    10     15      0      10     0     5     5     0  
    \n   背中          15    30     15      0      10     0    10     5     0  
    \n   腹            60    50     30      0      30     0    25    15     0  
    \n   尻尾          30    15     25      0      10     0     5     5     0  
    \n   翼            20    20     20      0      10     0    10     5     0  
    \n   脚            15    15     10      0       5     0    10     5     0       
    ```"

      end
    end
end