module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種ルコディオラ do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/c/c7/FrontierGen-Zenith_Rukodiora_Render_001.png/revision/latest?cb=20170705201845"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906346796324892732/zenith_rukodiora.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種ルコディオラ
    **別名:** 極龍
    **ランク:** 辿異
    **弱点属性:**    龍 <:zdragon:883119756528476161> と  氷 <:zice:883119912283938816> (肉質(怒り時時) Mode)
    **状態異常:** 異常磁場 <:zmagnet:883123524229820487> と 龍属性やられ【特大】 <:zdragon:883119756528476161>
    **属性:**    龍 <:zdragon:883119756528476161>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            20    35     30      0       5     0    20    10   100
    \n   腹            15    20     15      0      10     0    10     5     0
    \n   背中          10    10     10      0      10     0    10     5     0
    \n   尻尾          25    15     15      0      10     0    15     5     0
    \n   前脚          10    10     15      0      10     0     5     5     0
    \n   後脚          10    10     10      0      10     0     5     5     0
    \n   翼            35    25     20      0       5     0    20     5     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(磁力纏い)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0       5     0     0    25   100
    \n   腹            25    30     35      0      10     0     0    15     0
    \n   背中          15    15     25      0      10     0     0    15     0
    \n   尻尾          40    35     40      0      10     0     0    15     0
    \n   前脚          20    25     20      0      10     0     0    15     0
    \n   後脚          20    25     20      0      10     0     0    15     0
    \n   翼            45    25     20      0       5     0     0    15     0
    ```"

      end
    end
end