module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種ティガレックス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/7/75/FrontierGen-Zenith_Tigrex_Render_001.png/revision/latest?cb=20161105121827"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906348640493256704/zenith_tigrex.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種ティガレックス
    **別名:** 轟竜
    **ランク:** 辿異
    **弱点属性:**   雷 <:zthunder:883120020312440852> と    龍 <:zdragon:883119756528476161>
    **状態異常:** 裂傷 <:bleed:883124203723825162>
    **属性:** なし
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            35    40     30      0      10    20    10     0   110
    \n   首            25    20     15      0       5    10     5     0     0
    \n   腹            25    30     15     10      10    15     5     5     0
    \n   背中          30    30     25      0      10    15     0     5     0
    \n   尻尾          25    10     15      0       0     5    10     0     0
    \n   前脚          25    20     20      0      10    10    10     5     0
    \n   後脚          30    30     30      0       0     0     0     0     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                             肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            40    45     35      0      10    25    10     0   150
    \n   首            30    25     20      0       5    15     5     0     0
    \n   腹            25    30     20     10      10    20     5     5     0
    \n   背中          30    30     20      0      10    20     0     5     0
    \n   尻尾          25    10     15      0       0    10    10     0     0
    \n   前脚          30    25     25      0      10    15    10     5     0
    \n   後脚          30    30     30      0       0     0     0     0     0
    ```"

      end
    end
end