module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :辿異種ミドガロン do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/0/08/FrontierGen-Zenith_Midogaron_Render_001.png/revision/latest?cb=20170705201731"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906345042342473759/zenith_midogaron.png"
    msg.respond "***切削ダメージに基づく***
    **名前:** 辿異種ミドガロン
    **別名:** 爆狼
    **ランク:** 辿異
    **弱点属性:**  氷 <:zice:883119912283938816> と   水 <:zwater:883120128017965066>
    **状態異常:** 火属性やられ【特大】 <:zfire:883120156916744312>
    **属性:**   火 <:zfire:883120156916744312>
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            25    30     30      0      20     5     0    20   100
    \n   背中          20    15     30      0      15     5     0    15     0
    \n   胴体          15    20     10      0      10     5     0    10     0
    \n   脚            25    25     25      0      20     5     0    15     0
    \n   尻尾          30    20     20      0      10     5     0    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                                 肉質(怒り時時)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    35     30      0      20     5     0    25   100
    \n   背中          25    20     35      0      15     5     0    15     0
    \n   胴体          10    15      5      0      10     5     0    10     0
    \n   脚            30    30     25      0      25     5     0    20     0
    \n   尻尾          35    20     20      0      10     5     0    15     0
    ```"
    msg.respond "```
    \n                                肉質(咆哮時)									
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n   頭            25    30      5      0      20     5     0    25   100
    \n   背中          25    20      5      0      15     5     0    15     0
    \n   胴体          15    20      5      0      10     5     0    10     0
    \n   脚            30    30      5      0      20     5     0    15     0
    \n   尻尾          30    25      5      0      10     5     0    15     0
    ```"

      end
    end
end