module Bot::DiscordCommands
    module Monsters
      extend Discordrb::Commands::CommandContainer

      command :ゼルレウス do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/b/bd/FrontierGen-Zerureusu_Render_001.png/revision/latest?cb=20140324133444"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906351342841368646/zerureusu.png"
    msg.respond "***切削ダメージに基づく 肉質(対斬強化)***
    **名前:** ゼルレウス
    **別名:** 輝界竜
    **ランク:** HR5-剛種
    **弱点属性:** 闇 と 龍 <:zdragon:883119756528476161>
    **状態異常:** なし
    **属性:** 光
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100
    \n   首            25    30     25      0      10     0     0    25     0
    \n   背中          20    25     20      0      15     0     0    25     0
    \n   腹            30    30     25      0      10     0     0    15     0
    \n   尻尾          50    30     30      0      20     0    40     5     0
    \n   翼            25    25     50      0      20     0    40     5     0
    \n   脚            40    30     25      0      10     0    30    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(対斬強化)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100
    \n   首            25    30     25      0      10     0     0    25     0
    \n   背中          20    25     20      0      15     0     0    25     0
    \n   腹            30    30     25      0      10     0     0    15     0
    \n   尻尾          15    30     30      0      20     0    10     5     0
    \n   翼            25    25     50      0      20     0    40     5     0
    \n   脚            15    30     25      0      10     0     5    15     0
    ```"
    msg.respond "```
    \n                              肉質(対打強化)																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    15     20      0      20     0    10    10   100  
    \n   首            25    30     25      0      10     0     0    25     0  
    \n   背中          20    25     20      0      15     0     0    25     0  
    \n   腹            30    30     25      0      10     0     0    15     0  
    \n   尻尾          50    30     30      0      20     0    40     5     0  
    \n   翼            25    25     50      0      20     0    40     5     0  
    \n   脚            40    30     25      0      10     0    30    15     0 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                              肉質(対弾強化)						
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100  
    \n   首            25    30     25      0      10     0     0    25     0  
    \n   背中          20    25     20      0      15     0     0    25     0  
    \n   腹            30    30     25      0      10     0     0    15     0  
    \n   尻尾          50    30     30      0      20     0    40     5     0  
    \n   翼            25    25     15      0      20     0    10     5     0  
    \n   脚            40    30     25      0      10     0    30    15     0  
    ```"

      end
      command :ゼルレウス_G do |msg|
        # msg.respond  "https://static.wikia.nocookie.net/monsterhunter/images/8/80/FrontierGen-Zerureusu_Render_003.png/revision/latest?cb=20140404222842"
        msg.respond  "https://cdn.discordapp.com/attachments/902336832069595197/906351342841368646/zerureusu.png"
    msg.respond "***切削ダメージに基づく 肉質(対斬強化)***
    **名前:** ゼルレウス
    **別名:** 輝界竜
    **ランク:** Ｇ級
    **弱点属性:** 闇 と    龍 <:zdragon:883119756528476161>
    **状態異常:** なし
    **属性:** 光
    **弱点部位:** ```
    \n                                肉質
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100
    \n   首            25    30     25      0      10     0     0    25     0
    \n   背中          20    25     20      0      15     0     0    25     0
    \n   腹            30    30     25      0      10     0     0    15     0
    \n   尻尾          50    30     30      0      20     0    40     5     0
    \n   翼            25    25     50      0      20     0    40     5     0
    \n   脚            40    30     25      0      10     0    30    15     0
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n                              肉質(対斬強化)
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100
    \n   首            25    30     25      0      10     0     0    25     0
    \n   背中          20    25     20      0      15     0     0    25     0
    \n   腹            30    30     25      0      10     0     0    15     0
    \n   尻尾          15    30     30      0      20     0    10     5     0
    \n   翼            25    25     50      0      20     0    40     5     0
    \n   脚            15    30     25      0      10     0     5    15     0
    ```"
    msg.respond "```
    \n                              肉質(対打強化)																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    15     20      0      20     0    10    10   100  
    \n   首            25    30     25      0      10     0     0    25     0  
    \n   背中          20    25     20      0      15     0     0    25     0  
    \n   腹            30    30     25      0      10     0     0    15     0  
    \n   尻尾          50    30     30      0      20     0    40     5     0  
    \n   翼            25    25     50      0      20     0    40     5     0  
    \n   脚            40    30     25      0      10     0    30    15     0   
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- ----- 
    \n                              肉質(対弾強化)						
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            30    50     20      0      20     0    40    10   100  
    \n   首            25    30     25      0      10     0     0    25     0  
    \n   背中          20    25     20      0      15     0     0    25     0  
    \n   腹            30    30     25      0      10     0     0    15     0  
    \n   尻尾          50    30     30      0      20     0    40     5     0  
    \n   翼            25    25     15      0      20     0    10     5     0  
    \n   脚            40    30     25      0      10     0    30    15     0   
    ```"
    msg.respond "```
    \n                                肉質(？？)																
    \n   部位         切断   打撃   弾     火     水     雷      龍    氷   気絶 
    \n  ------------ ----- ----- ------ ------ ------- ----- ----- ----- -----
    \n   頭            10    10     10      0       0     0     0     0   100  
    \n   首            10    10     10      0       0     0     0     0     0  
    \n   背中          20    25     20      0      15     0     0    25     0  
    \n   腹            30    30     25      0      10     0     0    15     0  
    \n   尻尾          50    30     30      0      20     0    40     5     0  
    \n   翼            25    25     50      0      20     0    40     5     0  
    \n   脚            40    30     25      0      10     0    30    15     0     
    ```"

      end
    end
end